{
  "name": "manual_getting_started_Manual",
  "type": "manual",
  "description": "",
  "content": "// Unity Manual Page: Manual\n// URL: https://docs.unity3d.com/Manual/index.html\n// Content Length: 6523 characters\n\n// Manual Content:\nUnity 6.3 User Manual Unity 6.3 User Manual Documentation versions Unity 6.3 User Manual Unity 6.3 is the latest long-term support (LTS) release of the next generation of the Unity Engine. It combines the latest technologies and tools to deliver high-quality, high-performance experiences for all supported platforms. For more information about new features and how to upgrade your existing projects to this version, refer to the following: New in Unity Upgrade Unity Highlights of Unity 6 Explore the key features and updates introduced in the Unity 6 family of releases. Boost rendering performance Elevate your scenes A Scene contains the environments and menus of your game. Think of each unique Scene file as a unique level. In each Scene, you place your environments, obstacles, and decorations, essentially designing and building your game in pieces. More info See in Glossary with scalable, captivating visuals using the latest advances in rendering , lighting , and visual effects . Multiplayer game creation Simplify multiplayer game creation with Unity’s multiplayer packages and services . Expand multiplatform reach Build better experiences for mobile platforms, including a newly optimized runtime for mobile browsers, and get the latest multiplatform advances for all supported platforms. Unlock possibilities with Unity AI Accelerate creativity and development with AI tools for code generation , asset creation , and runtime inference , all integrated into the Unity Editor and Dashboard. Achieve more engaging visuals Create more engaging visuals with the latest updates to Lighting , Graphics performance and profiling , Shader Graph , and Visual Effect Graph . Enhance productivity and functionality Improve productivity and functionality across your entire Unity development environment with better profiling options, ProBuilder , Cinemachine , and UI Toolkit . Featured content Featured content of the Unity User Manual. Unity AI Create with AI-powered tools in the Unity Editor and Dashboard. Use Assistant for contextual help, Generators for asset creation, and Sentis to run models at runtime. Animation Animation in the Unity Editor, including the avatar An interface for retargeting animation from one rig to another. More info See in Glossary system, animation clips Animation data that can be used for animated characters or simple animations. It is a simple “unit” piece of motion, such as (one specific instance of) “Idle”, “Walk” or “Run”. More info See in Glossary , and state machines The set of states in an Animator Controller that a character or animated GameObject can be in, along with a set of transitions between those states and a variable to remember the current state. The states available will depend on the type of gameplay, but typical states include things like idling, walking, running and jumping. More info See in Glossary . Audio Audio in the Unity Editor, including clips, sources, listeners, importing and sound settings. Unity Building Blocks Add functional gameplay features that demonstrate Unity’s best practices. 2D game development Unity Editor’s 2D-specific features including gameplay, sprites A 2D graphic objects. If you are used to working in 3D, Sprites are essentially just standard textures but there are special techniques for combining and managing sprite textures for efficiency and convenience during development. More info See in Glossary , and physics. Lighting Set up realistic or stylized lighting to apply for a range of art styles. Multiplayer Multiplayer game development with Unity’s multiplayer packages and services. Physics Simulation of 3D motion, mass, gravity and collisions A collision occurs when the physics engine detects that the colliders of two GameObjects make contact or overlap, when at least one has a Rigidbody component and is in motion. More info See in Glossary . Platform development Information about the platforms that you can build your application for. Rendering Choose a render pipeline A series of operations that take the contents of a Scene, and displays them on a screen. Unity lets you choose from pre-built render pipelines, or write your own. More info See in Glossary and add your own rendering and post-processing A process that improves product visuals by applying filters and effects before the image appears on screen. You can use post-processing effects to simulate physical camera and film properties, for example Bloom and Depth of Field. More info post processing, postprocessing, postprocess See in Glossary . Scripting Program your games by using scripting in the Unity Editor. UI User interface toolkits available in the Unity Editor. Unity services Unity services such as Monetization and Cloud Services, Ads, Cloud Build, and Multiplayer. Visual effects Add and customize particle A small, simple image or mesh that is emitted by a particle system. A particle system can display and move particles in great numbers to represent a fluid or amorphous entity. The effect of all the particles together creates the impression of the complete entity, such as smoke. More info See in Glossary , lens flare A component that simulates the effect of lights refracting inside a camera lens. Use a Lens Flare to represent very bright lights or add atmosphere to your scene. More info See in Glossary , and full-screen effects. XR Develop augmented, mixed, and virtual reality Virtual Reality (VR) immerses users in an artificial 3D world of realistic images and sounds, using a headset and motion tracking. More info See in Glossary experiences with the Unity Editor. Additional resources 📖 E-Book : Advanced best practice guides - Best practice guides created by Unity experts. 👥 Community : Unity Discussions - A community-driven forum where you can find answers, announcements, and discussion topics. 💡 Resources : Unity Learn Tutorials - Free step-by-step tutorials and courses on using Unity, written by Unity staff. 💡 Resources : Unity Support Help Center - A collection of answers to frequently asked questions posed to Unity’s Support teams. 💡 Resources : Asset Store help - Answers to frequently asked questions on Asset Store content sharing. Unity 6.3 User Manual Documentation versions Copyright ©2005-2026 Unity Technologies. All rights reserved. Built from 6000.3.5f1 (9e864d5a2e6f). Built on: 2026-01-09. Tutorials Community Answers Knowledge Base Forums Asset Store Terms of use Legal Privacy Policy Cookies Do Not Sell or Share My Personal Information Your Privacy Choices (Cookie Settings)\n",
  "properties": []
}