{
  "name": "manual_graphics_Import",
  "type": "manual",
  "description": "",
  "content": "// Unity Manual: Textures_Import\n// URL: https://docs.unity3d.com/Manual/ImportingTextures.html\n\nMaterials and shaders\nCustom textures\nImport a texture\nMipmaps\n2D texture arrays\nImport a texture\nA\ntexture\nAn image used when rendering a GameObject, Sprite, or UI element. Textures are often applied to the surface of a mesh to give it visual detail.\nMore info\nSee in\nGlossary\nis a bitmap image. You can create textures in a digital content creation application, such as Photoshop, and import them into Unity.\nIn a 3D Project, Unity imports image and movie files in the Assets folder as Textures. In a 2D Project, Unity imports image and movie files in the Assets folder as\nSprites\nA 2D graphic objects. If you are used to working in 3D, Sprites are essentially just standard textures but there are special techniques for combining and managing sprite textures for efficiency and convenience during development.\nMore info\nSee in\nGlossary\n.\nAs long as the image meets the\nspecified size requirements\n, Unity imports and optimizes it for game use. This extends to\nmulti-layer Photoshop PSD or TIFF files\n.\nTo import image and movie files as Textures and Sprites in Unity:\nSelect the image file in the\nProject window\nA window that shows the contents of your\nAssets\nfolder (Project tab)\nMore info\nSee in\nGlossary\n.\nIn the\nInspector\nA Unity window that displays information about the currently selected GameObject, asset or project settings, allowing you to inspect and edit the values.\nMore info\nSee in\nGlossary\n, set the\nTexture Import Settings\n.\nClick the\nApply\nbutton to save the changes.\nTo use the imported Assets in your Project:\nFor 3D Projects,\ncreate a Material\nand assign the Texture to the new Material.\nFor 2D Projects, use the\nSprite Editor\n.\nSupported file formats\nUnity can read the following file formats:\nBMP\nEXR\nGIF\nHDR\nIFF\nJPG\nPICT\nPNG\nPSD\nTGA\nTIFF\nSVG\nUnity automatically flattens multi-layer Photoshop PSD or TIFF files on import so that there is no size penalty for your game. This flattening happens to the imported data in Unity, not to the file itself, so you can continue to save and import your PSD or TIFF files without losing any of your work when using these file types natively. This allows you to have one copy of each Texture which you can use in Photoshop, your 3D modelling application, and in Unity.\nWhen importing from an EXR or\nHDR\nhigh dynamic range\nSee in\nGlossary\nfile containing HDR information, the\nTexture Importer\nautomatically chooses the right HDR format for the output Texture. This format changes automatically depending on which platform you are building for.\nTexture dimensions\nIdeally, Texture dimension sizes should be powers of two on each side (that is, 2, 4, 8, 16, 32, 64, 128, 256, 512, 1024, 2048 pixels (px), and so on). The Textures do not have to be square; the width can be different from height.\nIt is possible to use NPOT (non-power of two) Texture sizes with Unity. However, NPOT Texture sizes generally take slightly more memory and might be slower for the GPU to sample, so it’s better for performance to use power of two sizes whenever you can.\nIf the platform or GPU does not support NPOT Texture sizes, Unity scales and pads the Texture up to the next power of two size. This process uses more memory and makes loading slower (especially on older mobile devices). In general, you should only use NPOT sizes for GUI purposes.\nYou can scale up NPOT Texture Assets at import time using the\nNon Power of 2\noption in the\nAdvanced\nsection of the Texture Importer.\nNote:\nSpecific platforms may impose maximum Texture dimension sizes. For DirectX, the maximum Texture sizes for different feature levels are as follows:\nGraphics APIs / Feature levels\nMaximum 2D and\nCubemap\nA collection of six square textures that can represent the reflections in an environment or the skybox drawn behind your geometry. The six squares form the faces of an imaginary cube that surrounds an object; each face represents the view along the directions of the world axes (up, down, left, right, forward and back).\nMore info\nSee in\nGlossary\ntexture dimension size (px)\nDX9\nShader\nA program that runs on the GPU.\nMore info\nSee in\nGlossary\nModel 2 (PC GPUs before 2004)\n2048\nDX9 Shader Model 3 (PC GPUs before 2006) / Windows Phone DX11 9.3 level / OpenGL ES 3.0\n4096\nDX10 Shader Model 4 / GL3 (PC GPUs before 2007) / OpenGL ES 3.1\n8192\nDX11 Shader Model 5 / GL4 (PC GPUs since 2008)\n16384\nNotes:\nThe Texture Importer only allows you to choose dimension sizes up to 16384 (16384 × 16384 pixels).\nMost\nMali GPUs\nsupport Texture dimension sizes up to 4K for cubemaps.\nPlatform-specific overrides\nWhen building for different platforms, you need to think about the resolution, the file size with associated memory size requirements, the quality of your Textures, and what\ncompression\nA method of storing data that reduces the amount of storage space it requires. See\nTexture Compression\n,\nAnimation Compression\n,\nAudio Compression\n,\nBuild Compression\n.\nSee in\nGlossary\nformat to use for each target platform. The\nPlatform-specific overrides\npanel provides one tab for the\nDefault\noptions, and one tab for every target platform you are building for.\n\nSome texture import settings can also be overridden globally in\nBuild Profiles\nA set of customizable configuration settings to use when creating a build for your target platform.\nMore info\nSee in\nGlossary\n, mostly to speed up iteration time during development.\nTo set up override values:\nSet the default properties on the\nDefault\ntab.\nNavigate to a specific target platform tab and enable the\nOverride for <target-platform>\noption.\nSet the override properties.\nAdditional resources\nTextures reference\nMipmaps\n2D texture arrays\n",
  "properties": []
}