{
  "name": "manual_physics_More_info",
  "type": "manual",
  "description": "",
  "content": "// Unity Manual: More info\n// Section: Physics\n// URL: https://docs.unity3d.com/Manual/CollidersOverview.html\n\n// Content:\nPhysics\nBuilt-in 3D physics\nCollision\nIntroduction to collision\nCollision\nIntroduction to collider types\nIntroduction to collision\nIn Unity, a\ncollision\nhappens when two\nGameObjects\nThe fundamental object in Unity scenes, which can represent characters, props, scenery, cameras, waypoints, and more. A GameObject’s functionality is defined by the Components attached to it.\nMore info\nSee in\nGlossary\nthat are configured for collision occupy the same physical space. Collision is a foundational part of most games, and many interactive applications and simulators.\nTo handle collision between GameObjects, Unity uses\ncolliders\n. A\ncollider\nis a Unity component that defines the shape of a GameObject for the purposes of physical collisions. Colliders are invisible, and do not need to be the same shape as the GameObject’s mesh.\nFor guidance on how to add components to a GameObject, see\nUse Components\n.\nEach 3D collider has a 2D equivalent. In Unity, 2D and 3D physics run on different physics simulation systems. For guidance on 2D physics colliders, see\nCollider 2D\n.\nCollider types\nA collider’s type is based on the configuration of its GameObject’s Collider and\nRigidbody\nA component that allows a GameObject to be affected by simulated gravity and other forces.\nMore info\nSee in\nGlossary\ncomponents. This configuration determines how a collider behaves, and how it interacts with other colliders.\nStatic colliders: The GameObject has a collider but no Rigidbody.\nRigidbody colliders: The GameObject has a collider and a Rigidbody.\nDynamic colliders: The Rigidbody is dynamic (that is, it has\nIs Kinematic\ndisabled).\nKinematic colliders: The Rigidbody is kinematic (that is, it has\nIs Kinematic\nenabled).\nThere is also a sub-type of collider called a\nTrigger collider\n. Trigger colliders do not physically collide with other colliders; instead, Unity calls a function when other colliders pass through them.\nTrigger colliders\nTrigger colliders don’t cause collisions. Instead, they detect other Colliders that pass through them, and call functions that you can use to initiate events (see\nUse collisions to trigger other events\n).\nTo turn a collider into a trigger collider, enable the\nIs Trigger\nproperty on the Collider component. A trigger collider does not collide with other colliders; instead, other colliders pass through it.\nFor a trigger collider to work, at least one GameObject involved in the collision must have a Rigidbody. Trigger colliders can be any collider type (static or Rigidbody), but in most cases it’s good practice to make the trigger collider a\nstatic collider\n. and add a Rigidbody to the GameObject that passes through the trigger. If several GameObjects are passing through one trigger, there must be a Rigidbody on at least one GameObject in each collision pair.\nTriggers can be any collider shape (see\nCollider shapes\n), and they can be visible or invisible. To make a trigger invisible, add the collider to an empty GameObject. Only add a trigger to a visible GameObject if it is okay for other GameObjects to visibly pass through it.\nFor gameplay and simulation, triggers might need some adjustment to make them feel intuitive for the player. For example, you could experiment with making a trigger collider slightly larger than its associated visible GameObject, so that it has a wider radius.\nFor information on how different collider types interact with each other on collision, see\nInteraction between collider types\n.\nCollider shapes\nCollider components are available in different shape configurations. There are three main shape types for colliders:\nPrimitive colliders\nare built-in simple shapes that you can attach to your GameObject and scale to approximately the same size and shape. You can also combine several primitive collider shapes to create\ncompound colliders\n.\nMesh colliders\nA free-form collider component which accepts a mesh reference to define its collision surface shape.\nMore info\nSee in\nGlossary\nexactly match the shape of the GameObject’s\nMesh\nThe main graphics primitive of Unity. Meshes make up a large part of your 3D worlds. Unity supports triangulated or Quadrangulated polygon meshes. Nurbs, Nurms, Subdiv surfaces must be converted to polygons.\nMore info\nSee in\nGlossary\n. They are more accurate than primitive colliders for complex shapes, but require more computational resources.\nWheel colliders\nA special collider for grounded vehicles. It has built-in collision detection, wheel physics, and a slip-based tire friction model. It can be used for objects other than wheels, but it is specifically designed for vehicles with wheels.\nMore info\nSee in\nGlossary\nare raycast-based Colliders specifically for in-game items that have physics-simulated wheels (for example, vehicles). They have built-in wheel physics, and controls for friction.\nCollider surfaces\nYou can control the friction and bounciness of a collider’s surface. When two colliders meet, the physics system uses the properties of each surface to calculate the friction and bounce between them.\nFor more information, see\nCollider surfaces\n.\nCollision\nIntroduction to collider types\nCopyright ©2005-2026 Unity Technologies. All rights reserved. Built from 6000.3.5f1 (9e864d5a2e6f). Built on: 2026-01-09.\nTutorials\nCommunity Answers\nKnowledge Base\nForums\nAsset Store\nTerms of use\nLegal\nPrivacy Policy\nCookies\nDo Not Sell or Share My Personal Information\nYour Privacy Choices (Cookie Settings)\n",
  "properties": []
}