{
  "name": "manual_2d_2D_2D_renderer_sorting",
  "type": "manual",
  "description": "",
  "content": "// Unity Manual: 2D renderer sorting\n// Section: 2D\n// URL: https://docs.unity3d.com/Manual/2d-renderer-sorting.html\n\n// Content:\n2D game development\n2D renderer sorting\n2D game art style reference\nSprites\n2D renderer sorting\nOverview\nUnity sorts Renderers according to a priority order that depends on their types and usages. You can specify the render order of Renderers through their\nRender Queue\n. In general, there are two main queues: the\nOpaque queue\nand the\nTransparent queue\n. 2D Renderers are mainly within the Transparent queue, and include the\nSprite Renderer\nA component that lets you display images as Sprites for use in both 2D and 3D scenes.\nMore info\nSee in\nGlossary\n,\nTilemap Renderer\n, and\nSprite Shape Renderer\ntypes.\nTransparent Queue Sorting Order by Priority\n2D Renderers within the Transparent Queue generally follow the priority order below:\nSorting Layer and Order in Layer\nSpecify Render Queue\nDistance to Camera\nPerspective\nOrthographic\nCustom Axis sort mode\nSprite Sort Point\nSorting Group\nMaterial/Shader\nTiebreaker\nThere are other factors which can cause the sorting order to differ from the regular priority order. These factors vary from project to project.\nSorting Layer and Order in Layer\nThe\nSorting Layer\nand\nOrder in Layer\n(in the Renderer’s\nProperty\nsettings) are available to all 2D Renderers through the\nInspector\nA Unity window that displays information about the currently selected GameObject, asset or project settings, allowing you to inspect and edit the values.\nMore info\nSee in\nGlossary\nwindow or via the Unity Scripting API. Set the Renderer to an existing\nSorting Layer\nor create a new one to determine its priority in the rendering queue. Change the value of the\nOrder in Layer\nto set the Renderer’s priority among other Renderers within the same\nSorting Layer\n.\nSpecify Render Queue\nYou can specify the Render Queue type of the Renderer in its Material settings or in the\nShader\nA program that runs on the GPU.\nMore info\nSee in\nGlossary\nsettings of its Material. This is useful for grouping and sorting Renderers which are using different Materials. Refer to documentation on\nShaderLab: SubShader Tags\nfor more details.\nDistance to Camera\nThe\nCamera component\nsorts Renderers based on its\nProjection\nsetting. The two options are\nPerspective\nand\nOrthographic\n.\nPerspective\nIn this mode, the sorting distance of a Renderer is the direct distance of the Renderer from the\nCamera\nA component which creates an image of a particular viewpoint in your scene. The output is either drawn to the screen or captured as a texture.\nMore info\nSee in\nGlossary\n’s position.\nOrthographic\nThe sorting distance of a Renderer is the distance between the position of the Renderer and the Camera along the Camera’s view direction. For the default 2D setting, this is along the (0, 0, 1) axis.\nWhen you set the Camera component to\nPerspective\nor\nOrthographic,\nUnity automatically sets the Camera’s\nTransparencySortMode\nto match the selected mode. You can set the Transparency Sort Mode manually in two ways:\nOpen the\nProject Settings\nA broad collection of settings which allow you to configure how Physics, Audio, Networking, Graphics, Input and many other areas of your project behave.\nMore info\nSee in\nGlossary\nand go to\nGraphics\n, then under\nCamera Settings\nuse Transparent Sort Mode\nSet the Camera’s\nTransparencySortMode\nvia the Scripting API.\nThe Camera\nTransparency Sort Mode\nsettings are under the\nGraphics\ncategory in the\nProject Settings\n(main menu:\nEdit\n>\nProject Settings\n>\nGraphics\n). When this is set to\nDefault\n, a Camera component’s Projection setting take priority. When this is set to an option other than\nDefault\n, the Camera component’s Projection setting remains the same, but the Camera’s\nTransparency Sort Mode\nchanges to that option.\nAn additional option available through the Project settings and via the Scripting API is the\nCustom Axis sort mode\n.\nCustom Axis sort mode\nSelect this mode to sort Renderers based on their distance along the custom axis you set in the Project settings (main menu:\nEdit\n>\nProject Settings\n>\nGraphics\n>\nTransparency Sort Axis\n). This is commonly used in projects with\nIsometric Tilemaps\nto sort and render the Tile Sprites correctly on the Tilemap. Refer to\nCreating an Isometric Tilemap\nfor further information.\nNote:\nIf your project is a 2D Universal\nRender Pipeline\nA series of operations that take the contents of a Scene, and displays them on a screen. Unity lets you choose from pre-built render pipelines, or write your own.\nMore info\nSee in\nGlossary\n(URP) project, the\nTransparency Sort Mode\nisn’t available in the\nProject Settings\n, and is instead configured in the 2D Renderer asset properties. Refer to the\nConfigure the 2D Renderer Asset documentation\nfor more information.\nSprite Sort Point\nBy default, a\nSprite\nA 2D graphic objects. If you are used to working in 3D, Sprites are essentially just standard textures but there are special techniques for combining and managing sprite textures for efficiency and convenience during development.\nMore info\nSee in\nGlossary\n’s\nSort Point\nis set to its\nCenter\n, and Unity measures the distance between the camera’s Transform position and the Center of the Sprite to determine their render order during sorting. An alternate option is to set a Sprite’s\nSort Point\nto its\nPivot\nposition in World Space. Select the\nPivot\noption in the Sprite’s\nSprite Renderer\nproperty settings and edit the Sprite’s Pivot position in the\nSprite Editor\n.\nSorting Group\nThe\nSorting Group\nis a component that groups Renderers which share a common root together for sorting purposes. All Renderers within the same Sorting Group share the same\nSorting Layer, Order in Layer,\nand\nDistance to Camera\n. Refer to documentation on the\nSorting Group\ncomponent and its settings for more details.\nMaterial/Shader\nUnity sorts Renderers with the same\nMaterial settings\ntogether for more efficient rendering performance, such as with\ndynamic batching\nAn automatic Unity process which attempts to render multiple meshes as if they were a single mesh for optimized graphics performance. The technique transforms all of the GameObject vertices on the CPU and groups many similar vertices together.\nMore info\nSee in\nGlossary\n.\nTiebreaker\nWhen multiple Renderers have identical sorting priority, the tiebreaker is the order that Unity places the Renderers in the Render Queue. Because this is an internal process that you have no control over, you should use the sorting options (such as\nSorting Layers\nand\nSorting Groups\n) to make sure all Renderers have distinct sorting priorities.\n2D game art style reference\nSprites\nCopyright ©2005-2026 Unity Technologies. All rights reserved. Built from 6000.3.5f1 (9e864d5a2e6f). Built on: 2026-01-09.\nTutorials\nCommunity Answers\nKnowledge Base\nForums\nAsset Store\nTerms of use\nLegal\nPrivacy Policy\nCookies\nDo Not Sell or Share My Personal Information\nYour Privacy Choices (Cookie Settings)\n",
  "properties": []
}