{
  "name": "manual_ui_IMGUI_Immediate_Mode_GUI",
  "type": "manual",
  "description": "",
  "content": "// Unity Manual: IMGUI (Immediate Mode GUI)\n// Section: UI\n// URL: https://docs.unity3d.com/Manual/GUIScriptingGuide.html\n\n// Content:\nUI systems\nIMGUI (Immediate Mode GUI)\nuGUI\nIMGUI Basics\nIMGUI (Immediate Mode GUI)\nIMGUI (Immediate Mode GUI) is an entirely separate feature to Unity’s main GameObject-based UI System. IMGUI is a code-driven GUI system, and is mainly intended as a tool for programmers. It is driven by calls to the\nOnGUI\nfunction on any script which implements it. For example, this code:\nvoid OnGUI() {\n\n if (GUILayout.Button(\"Press Me\")){ \n\n Debug.Log(\"Hello!\");\n\n }\n\n }\nWould result in a button displayed like so:\nThe result of the above code example\nIMGUI is commonly used for:\nCreating in-game debugging displays and tools.\nCreating custom\ninspectors\nA Unity window that displays information about the currently selected GameObject, asset or project settings, allowing you to inspect and edit the values.\nMore info\nSee in\nGlossary\nfor script components.\nCreating new editor windows and tools to extend Unity itself.\nIMGUI is not generally intended to be used for normal in-game user interfaces that players might use and interact with. For that you should use Unity’s main GameObject-based\nUI system\n, which offers a GameObject-based approach for editing and positioning UI elements, and has far better tools to work with the visual design and layout of the UI.\n“Immediate Mode” refers to the way the IMGUI is created and drawn. To create IMGUI elements, you must write code that goes into a special function named OnGUI. The code to display the interface is executed every frame, and drawn to the screen. There are no persistent\ngameobjects\nThe fundamental object in Unity scenes, which can represent characters, props, scenery, cameras, waypoints, and more. A GameObject’s functionality is defined by the Components attached to it.\nMore info\nSee in\nGlossary\nother than the object to which your OnGUI code is attached, or other types of objects in the hierarchy related to the\nvisual elements\nA node of a visual tree that instantiates or derives from the C#\nVisualElement\nclass. You can style the look, define the behaviour, and display it on screen as part of the UI.\nMore info\nSee in\nGlossary\nthat are drawn.\nIMGUI allows you to create a wide variety of functional GUIs using code. Rather than creating GameObjects, manually positioning them, and then writing a script that handles its functionality, you can do everything at once with just a few lines of code. The code produces\nGUI controls\nthat are drawn and handled with a single function call.\nThis section explains how to use IMGUI both in your game and in extensions to the Unity editor.\nuGUI\nIMGUI Basics\nCopyright ©2005-2026 Unity Technologies. All rights reserved. Built from 6000.3.5f1 (9e864d5a2e6f). Built on: 2026-01-09.\nTutorials\nCommunity Answers\nKnowledge Base\nForums\nAsset Store\nTerms of use\nLegal\nPrivacy Policy\nCookies\nDo Not Sell or Share My Personal Information\nYour Privacy Choices (Cookie Settings)\n",
  "properties": []
}