{
  "name": "manual_animation_Animation",
  "type": "manual",
  "description": "",
  "content": "// Unity Manual: Animation\n// Section: Animation\n// URL: https://docs.unity3d.com/Manual/AnimationSection.html\n\n// Content:\nAnimation\nCreate TreeView with IMGUI\nMecanim Animation system\nAnimation\nAn animation system provides tools and processes to animate the properties of models and assets. For example, use an animation system to animate transform properties to move and rotate a model, or animate the intensity property to dim a light.\nCommon tools include importers that import animation and models, editors that create and modify animation, and real-time animation\nstate machines\nThe set of states in an Animator Controller that a character or animated GameObject can be in, along with a set of transitions between those states and a variable to remember the current state. The states available will depend on the type of gameplay, but typical states include things like idling, walking, running and jumping.\nMore info\nSee in\nGlossary\nthat determine which animation plays and when. Some animation systems also include specialized tools that define a humanoid model and retarget animation between models with the same definition.\nUnity has two animation systems with different capabilities and performance characteristics:\nAnimation system\nDescription\nMecanim animation system\nThe Mecanim animation system (Mecanim) is a rich and sophisticated animation system that uses the\nAnimator component\nA component on a model that animates that model using the Animation system. The component has a reference to an Animator Controller asset that controls the animation.\nMore info\nSee in\nGlossary\n, the\nAnimation window\n, and the\nAnimator window\nThe window where the Animator Controller is visualized and edited.\nMore info\nSee in\nGlossary\n. Mecanim is the recommended animation system for most situations. It provides better performance for complex character animation with many\nanimation curves\nAllows you to add data to an imported clip so you can animate the timings of other items based on the state of an animator. For example, for a game set in icy conditions, you could use an extra animation curve to control the emission rate of a particle system to show the player’s condensing breath in the cold air.\nMore info\nSee in\nGlossary\nand\nblending\n.\nLegacy animation system\nUnity’s Legacy animation system (Legacy) has a limited\nfeature set\nA\nfeature set\nis a collection of related packages that you can use to achieve specific results in the Unity Editor. You can manage feature sets directly in Unity’s Package Manager.\nMore info\nSee in\nGlossary\nthat predates Mecanim. Legacy uses the\nAnimation component\nand the special\nLegacy\nimport option in the\nRig tab of the Import Settings window\n. Legacy is less complex for simple animation. Legacy is still available for backward compatibility with old Unity projects.\nAdditional resources and examples\n👥\nCommunity\n:\nJoin the conversation on Unity Discussions for Animation\n📖\nE-Book\n:\nThe definitive guide to animation in Unity\n📖\nE-Book\n:\n2D game art, animation, and lighting for artists\n📝\nHow-to guide\n:\nHow to troubleshoot imported animations in Unity\n📝\nHow-to guide\n:\nTips for building animator controllers in Unity\n📝\nHow-to guide\n:\nHow to animate 2D characters in Unity 2022 LTS\n📺\nVideo\n:\nHow to work with humanoid animations in Unity\nCreate TreeView with IMGUI\nMecanim Animation system\nCopyright ©2005-2026 Unity Technologies. All rights reserved. Built from 6000.3.5f1 (9e864d5a2e6f). Built on: 2026-01-09.\nTutorials\nCommunity Answers\nKnowledge Base\nForums\nAsset Store\nTerms of use\nLegal\nPrivacy Policy\nCookies\nDo Not Sell or Share My Personal Information\nYour Privacy Choices (Cookie Settings)\n",
  "properties": []
}