{
  "name": "manual_scripting_Compilation_and_code_reload",
  "type": "manual",
  "description": "",
  "content": "// Unity Manual: Compilation and code reload\n// Section: Scripting\n// URL: https://docs.unity3d.com/Manual/compilation-and-code-reload.html\n\n// Content:\nProgramming in Unity\nCompilation and code reload\nUsing randomness\nScript compilation\nCompilation and code reload\nCompilation transforms the code you write into code that runs in a given context on a given platform. As you work in the Unity Editor, there are several scenarios where Unity may recompile and reload your code. Depending on your settings and the location of your code, opening the Editor for the first time, modifying your code, reimporting a script asset, and entering Play mode can all trigger code reload.\nReloading code is an important way to preserve or reset data between context switches and to ensure relevant changes take effect, but it can negatively impact your development iteration times. It’s important to understand when, why, and how Unity compiles and reloads\nscripts\nA piece of code that allows you to create your own Components, trigger game events, modify Component properties over time and respond to user input in any way you like.\nMore info\nSee in\nGlossary\nand other assets and how you can configure this behavior. It’s also important to understand how Unity prioritizes executing different parts of your compiled code to ensure things happen in the order you intend them to.\nTopic\nDescription\nScript compilation\nHow and in what order Unity compiles your scripts and how you can organize your scripts into assemblies.\nCode and scene reload on entering Play mode\nUnderstand what Unity reloads by default on entering Play mode and how you can configure this behavior for faster development iteration times.\nScript serialization\nDetails of how Unity transforms your scripted data structures and object states into a serialized format for storage or reconstruction later on, and how this affects your application performance.\nIntegrating third-party code libraries (plug-ins)\nAdd third-party code libraries to your Unity project.\nAdditional resources\nC# Compiler\nUsing randomness\nScript compilation\nCopyright ©2005-2026 Unity Technologies. All rights reserved. Built from 6000.3.5f1 (9e864d5a2e6f). Built on: 2026-01-09.\nTutorials\nCommunity Answers\nKnowledge Base\nForums\nAsset Store\nTerms of use\nLegal\nPrivacy Policy\nCookies\nDo Not Sell or Share My Personal Information\nYour Privacy Choices (Cookie Settings)\n",
  "properties": []
}