{
  "name": "manual_animation_Mecanim_animation_system",
  "type": "manual",
  "description": "",
  "content": "// Unity Manual: Mecanim animation system\n// Section: Animation\n// URL: https://docs.unity3d.com/Manual/AnimationOverview.html\n\n// Content:\nAnimation\nMecanim Animation system\nAnimation\nAnimation clips\nMecanim Animation system\nThe Mecanim Animation system is based on\nanimation clips\nAnimation data that can be used for animated characters or simple animations. It is a simple “unit” piece of motion, such as (one specific instance of) “Idle”, “Walk” or “Run”.\nMore info\nSee in\nGlossary\n. An animation clip contains information about how a character or\nGameObject\nThe fundamental object in Unity scenes, which can represent characters, props, scenery, cameras, waypoints, and more. A GameObject’s functionality is defined by the Components attached to it.\nMore info\nSee in\nGlossary\nchanges its position, rotation, or other properties over time. Think of each animation clip as a recording. An animation clip from an external source is created by an artist or animator with third-party software, such as Autodesk® 3ds Max® or Autodesk® Maya®.\nYou can organize many animation clips into a structured flowchart-like system called an\nAnimator Controller\nControls animation through Animation Layers with Animation State Machines and Animation Blend Trees, controlled by Animation Parameters. The same Animator Controller can be referenced by multiple models with Animator components.\nMore info\nSee in\nGlossary\n. The Animator Controller acts as a\nstate machine\nThe set of states in an Animator Controller that a character or animated GameObject can be in, along with a set of transitions between those states and a variable to remember the current state. The states available will depend on the type of gameplay, but typical states include things like idling, walking, running and jumping.\nMore info\nSee in\nGlossary\nwhich keeps track of the animation clip being played and the criteria for when the next animation clip should be played.\nFor example, a simple Animator Controller might contain a single animation clip for a collectable item that spins and bounces. An Animator Controller for a door might contain two animation clips: one for the door opening and a second for the door closing.\nA more advanced Animator Controller might contain a dozen\nhumanoid animations\nAn animation using humanoid skeletons. Humanoid models generally have the same basic structure, representing the major articulate parts of the body, head and limbs. This makes it easy to map animations from one humanoid skeleton to another, allowing retargeting and inverse kinematics.\nMore info\nSee in\nGlossary\nfor each of a character’s actions such as idle, turning, walking, and jogging. This Animator Controller might use\nblend trees\nto blend between multiple animation clips and provide fluid motion as the player moves around the\nscene\nA Scene contains the environments and menus of your game. Think of each unique Scene file as a unique level. In each Scene, you place your environments, obstacles, and decorations, essentially designing and building your game in pieces.\nMore info\nSee in\nGlossary\n.\nThe Mecanim Animation system also provides special features for handling humanoid characters including the ability to\nretarget\nanimation from one source to another and adjust\nmuscle definitions\nThis allows you to have more intuitive control over the character’s skeleton. When an Avatar is in place, the Animation system works in muscle space, which is more intuitive than bone space.\nMore info\nSee in\nGlossary\nto ensure that a character deforms correctly. For example, you can retarget animation from a third-party animation library to your own character then adjust the its range of motion. These special features are available through Unity’s\nAvatar\nAn interface for retargeting animation from one rig to another.\nMore info\nSee in\nGlossary\nsystem which maps humanoid characters to a common internal format.\nThe Animation Clips, the Animator Controller, and the Avatar, are connected together through a GameObject with the\nAnimator Component\nA component on a model that animates that model using the Animation system. The component has a reference to an Animator Controller asset that controls the animation.\nMore info\nSee in\nGlossary\n. This component references an Animator Controller and, if required, the Avatar for the model. The Animator Controller also references its animation clips.\nHow the parts of the Mecanim Animation system connect together\nThe previous diagram demonstrates the following workflow:\nAnimation clips are\nimported from an external source\nor created within Unity. In this example, they are\nimported humanoid animations\n.\nAnimation clips are placed and arranged in an Animator Controller. This demonstrates an Animator Controller in the\nAnimator window\nThe window where the Animator Controller is visualized and edited.\nMore info\nSee in\nGlossary\n. The States, which may represent animations or nested sub-state machines, display as nodes connected by lines. This Animator Controller exists as an asset in the\nProject window\nA window that shows the contents of your\nAssets\nfolder (Project tab)\nMore info\nSee in\nGlossary\n.\nThe rigged character model, an astronaut named\nAstrella\n, has a specific configuration of bones mapped to Unity’s\nAvatar\nformat. The mapping is stored as an Avatar asset, under the imported character model in the Project window.\nWhen animating the character model, it has an Animator component attached. In the\nInspector\nA Unity window that displays information about the currently selected GameObject, asset or project settings, allowing you to inspect and edit the values.\nMore info\nSee in\nGlossary\nwindow, the\nAnimator Component\nhas the\nAnimator Controller\nand the\nAvatar\nassigned. The animator uses these together to animate the model. The Avatar reference is only necessary when animating a humanoid character. For\nother types of animation\n, only an Animator Controller is required.\nThe following topics provide more details on the Mecanim Animation system:\nAnimation Clips\nHumanoid Avatars\nAnimator component\nAnimator Controller\nAnimator Override Controller\nAllows you to create multiple variants of an Animator Controller, with each variant using a different set of animations, while retaining the original Controller’s structure, parameters and logic.\nMore info\nSee in\nGlossary\nPlayables API\nPerformance and Optimization\nMecanim FAQ\nAnimation\nAnimation clips\nCopyright ©2005-2026 Unity Technologies. All rights reserved. Built from 6000.3.5f1 (9e864d5a2e6f). Built on: 2026-01-09.\nTutorials\nCommunity Answers\nKnowledge Base\nForums\nAsset Store\nTerms of use\nLegal\nPrivacy Policy\nCookies\nDo Not Sell or Share My Personal Information\nYour Privacy Choices (Cookie Settings)\n",
  "properties": []
}