{
  "name": "manual_getting_started_2D_Terms_of_use",
  "type": "manual",
  "description": "",
  "content": "// Unity Manual: Terms of use\n// Section: 2D\n// URL: https://docs.unity3d.com/Manual/TermsOfUse.html\n\n// Content:\nUnity 6.3 User Manual\nTrademarks and terms of use\nOffline documentation\nWhat's new in Unity\nTrademarks and terms of use\n“Unity”, Unity logos, and other Unity trademarks are trademarks or registered trademarks of Unity Technologies or its affiliates in the U.S. and elsewhere (more info\nhere\n). Other names or brands are trademarks of their respective owners.\nCode snippets in the Unity Editor Manual and Scripting Reference are licensed under the Unity Companion License for Unity-dependent projects (see\nhttps://unity.com/legal/licenses/unity-companion-license\n). Unless expressly provided otherwise, the Software under this license is made available strictly on an “AS IS” BASIS WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED. Please review the license for details on these and other terms and conditions.\n\nAll other information in the Unity Manual and Scripting Reference is licensed under the\nCreative Commons Attribution-NonCommercial-NoDerivatives 4.0 International\n(CC BY-NC-ND)\nThe Unity Editor Manual and Scripting Reference may contain links to third-party websites or resources. You acknowledge and agree that Unity is not responsible or liable for: (i) the availability or accuracy of such websites or resources; or (ii) the content, products, or services on or available from such websites or resources. Links to such websites or resources do not imply any endorsement by Unity of such websites or resources or the content, products, or services available from such websites or resources. You acknowledge sole responsibility for and assume all risk arising from your use of any such websites or resources.\nOffline documentation\nWhat's new in Unity\nCopyright ©2005-2026 Unity Technologies. All rights reserved. Built from 6000.3.5f1 (9e864d5a2e6f). Built on: 2026-01-09.\nTutorials\nCommunity Answers\nKnowledge Base\nForums\nAsset Store\nTerms of use\nLegal\nPrivacy Policy\nCookies\nDo Not Sell or Share My Personal Information\nYour Privacy Choices (Cookie Settings)\n",
  "properties": []
}