{
  "name": "manual_other_Creating",
  "type": "manual",
  "description": "",
  "content": "// Unity Manual: Terrain_Creating\n// URL: https://docs.unity3d.com/Manual/terrain-UsingTerrains.html\n\nWorld building\nTerrain\nCreate and edit Terrains\nTerrain\nCreate Neighbor Terrains\nCreate and edit Terrains\nTo add a Terrain GameObject to your Scene, select\nGameObject > 3D Object > Terrain\nfrom the menu. This also adds a corresponding Terrain Asset to the Project view. When you do this, the landscape is initially a large, flat plane. The Terrain’s Inspector window provides a number of tools to create detailed landscape features.\nTerrain editing tools in the Inspector\nTerrain editing tools in the Inspector\nThe\ntoolbar\nA row of buttons and basic controls at the top of the Unity Editor that allows you to interact with the Editor in various ways (e.g. scaling, translation).\nMore info\nSee in\nGlossary\nprovides five options to adjust your Terrain:\nCreate adjacent Terrain tiles\n.\nSculpt\nand\npaint\nyour Terrain.\nAdd\ntrees\nA GameObject and associated Component that allows you to add tree assets to your Scene. You can add branch levels and leaves to trees in the Tree Inspector window.\nMore info\nSee in\nGlossary\n.\nAdd\ndetails such as grass, flowers, and rocks\n.\nChange\nsettings for the selected Terrain\n.\nSelect the paintbrush icon to access painting tools, which allow you to modify the Terrain. Use the cursor to sculpt the height of the Terrain, or paint texture onto the Terrain. Choose from several built-in Brush shapes, or define your own Brush using a texture. You can also change the size and opacity (the strength of the applied effect) of the Brush. Once you’ve defined the properties, your cursor takes the shape of the selected Brush. Click or drag on the Terrain to create different shapes and textures.\nSimilar to how you paint with a Brush on the Terrain, you can add textures, trees, and details like grass, flowers, and rocks. You can also create additional connected Terrain tiles, change the height of an entire tile, and even write custom Brushes with complex effects.\nTerrain Overlay Windows\nTerrain tools can be used with overlays. When a Terrain\nGameObject\nThe fundamental object in Unity scenes, which can represent characters, props, scenery, cameras, waypoints, and more. A GameObject’s functionality is defined by the Components attached to it.\nMore info\nSee in\nGlossary\nis selected, overlays will appear in the\nScene\nA Scene contains the environments and menus of your game. Think of each unique Scene file as a unique level. In each Scene, you place your environments, obstacles, and decorations, essentially designing and building your game in pieces.\nMore info\nSee in\nGlossary\nView. These overlays can be docked, dragged, and collapsed.\nThe\nTerrain Toolbar\noverlay contains the terrain tools, divided into categories. From left to right, the menu buttons are\nSculpt Mode\n,\nMaterials Mode\n,\nFoliage Mode\n, and\nNeighbor Terrains Mode\n. If there are custom tools which inherit from\nTerrainAPI.TerrainPaintToolWithOverlays\n, they will appear in a fifth menu button for\nCustom Brushes Mode\n.\nTerrain Toolbar\nThe\nTool Settings\noverlay can be found under the overlay with this icon\n. Some tools have additional settings that can be edited. For example, here is what the tool settings overlay looks like for the Set Height Tool.\nSet Height Tool Settings\nCertain tools may have brush masks. When selecting a tool that has access to brushes, the\nBrush Masks\noverlay will be visible.\nBrush Masks in Overlays\nCertain tools which have access to brushes may also have access to the\nBrush Attributes\noverlay, in which users can change tool settings like brush opacity and size.\nBrush Attributes in Overlays\nThe Paint Details tool has access to Target Strength in this overlay.\nBrush Attributes Target Strength in Overlays\nTerrain keyboard shortcuts\nThe Terrain\nInspector\nA Unity window that displays information about the currently selected GameObject, asset or project settings, allowing you to inspect and edit the values.\nMore info\nSee in\nGlossary\nhas the following keyboard shortcuts enabled by default.\nKeys\nFunction\nComma ( , ) and Period ( . )\nCycle through the available Brushes\nShift-Comma ( < ) and Shift-Period ( > )\nCycle through the available objects for trees, textures, and details\nOpen Bracket ( [ ) and Close Bracket ( ] )\nDecrease and increase the Brush Size\nMinus ( - ) and Equal ( = )\nDecrease and increase Brush Opacity\nTo set your own custom shortcuts, use the\nShortcuts Manager\n.\nOn Windows and Linux, select\nEdit > Shortcuts\n.\nOn macOS, select\nUnity > Shortcuts\n.\nUnder\nCategory\nA Profiler category identifies the workload data for a Unity subsystem (for example, Rendering, Scripting and Animation categories). Unity applies color-coding to categories to help visually distinguish the types of data in the Profiler window.\nMore info\nSee in\nGlossary\n, select\nTerrain\nto display Terrain-related shortcut assignments. For more information about setting and modifying shortcuts, refer to\nKeyboard shortcuts\n.\nList of Terrain shortcuts\nAdditionally, the standard F keystroke works slightly differently for Terrain. As Terrains are typically very large, when you press the F key, the\nScene view\nAn interactive view into the world you are creating. You use the Scene View to select and position scenery, characters, cameras, lights, and all other types of Game Object.\nMore info\nSee in\nGlossary\nfocuses on the area where you position the cursor. This provides a very quick and intuitive way to jump to the Terrain area you want to edit. If you press F while the cursor is not over a Terrain tile, it uses the standard framing behavior, framing the selection around the whole GameObject when you place the cursor over the Scene view.\nAdditional resources\nScripting Reference for custom Terrain tools\nTerrain\nCreate Neighbor Terrains\n",
  "properties": []
}