{
  "name": "manual_other_Workflow",
  "type": "manual",
  "description": "",
  "content": "// Unity Manual: Assets_Workflow\n// URL: https://docs.unity3d.com/Manual/AssetWorkflow.html\n\nAssets and media\nIntroduction to assets in Unity\nAssets and media\nImporting assets\nIntroduction to assets in Unity\nAn asset is any item that you use in your Unity project to create your application, such as textures, 3D models, or sound files. Assets can include:\nVisual elements\nA node of a visual tree that instantiates or derives from the C#\nVisualElement\nclass. You can style the look, define the behaviour, and display it on screen as part of the UI.\nMore info\nSee in\nGlossary\n: 3D models, textures, or\nsprites\nA 2D graphic objects. If you are used to working in 3D, Sprites are essentially just standard textures but there are special techniques for combining and managing sprite textures for efficiency and convenience during development.\nMore info\nSee in\nGlossary\n.\nAudio elements\n: Sound effects or music.\nAbstract items\n: Color gradients, animation masks, arbitrary text, or numeric data.\nImporting assets\nTo use assets in Unity, you must\nimport them into your project\n. You can\nadd assets to the\nAssets\nfolder\nof your project, or\nuse scripts\nto import assets automatically.\nUnity supports a wide range of asset formats. For more information, refer to\nSupported asset type reference\n.\nIf you’re working on a complex project with a large team of people, you can use the\nUnity Accelerator\ncache server to speed up asset management.\nHow Unity manages assets\nUnity uses the\nAsset Database\nto store the assets in your project and maintain consistency between the original source files and their imported versions used by your application at runtime. You can use the\nImport Activity window\nto inspect how Unity imports the assets in your project.\nGrouping assets together\nYou can use\nAssetBundles\nto group together assets in an archive file format, which you can then use to update assets remotely, or provide DLC content for your application.\nYou can also use\nasset packages\nA collection of files and data from Unity projects, or elements of projects, which are compressed and stored in one file, similar to Zip files, with the\n.unitypackage\nextension. Asset packages are a handy way of sharing and re-using Unity projects and collections of assets.\nMore info\nSee in\nGlossary\nto package assets together to share between other Unity projects.\nManaging assets through scripts\nYou can perform many of the loading, importing, and unloading operations that Unity does with the\nAsset Database APIs\n.\nAn alternative method of managing loading assets is with the\nResources system\n, but it can impact on the performance of your application.\nThe\nAddressables package\nprovides a streamlined workflow for managing asset loading at runtime and is the recommended system for organizing assets in Unity projects.\nAdditional resources\nSupported asset type reference\nIntroduction to Unity Accelerator\nProgramming with the Asset Database\nIntroduction to AssetBundles\nAssets and media\nImporting assets\n",
  "properties": []
}