{
  "name": "manual_physics_Disable_and_strip_the_physics_integration_from_your_project",
  "type": "manual",
  "description": "",
  "content": "// Unity Manual: Disable and strip the physics integration from your project\n// Section: Physics\n// URL: https://docs.unity3d.com/Manual/physics-remove-backend.html\n\n// Content:\nPhysics\nDisable and strip the physics integration from your project\nPhysics integrations in Unity\nInput\nDisable and strip the physics integration from your project\nDisable and strip the physics integration SDK from your project to meet specific performance or feature requirements.\nUnity supports a number of versatile and performant\nphysics engine integrations\n. However, if your project doesn’t require physics simulation, you can disable and even remove the physics integration entirely from your project. This can result in a smaller build size for certain build platforms and more optimized resource usage. When you do, all physics-related functionality, such as physics APIs and components, no longer work in your project.\nIf you enabled\nStrip Engine Code\nin\nProject settings\nA broad collection of settings which allow you to configure how Physics, Audio, Networking, Graphics, Input and many other areas of your project behave.\nMore info\nSee in\nGlossary\n, you must set\nGameObject\nThe fundamental object in Unity scenes, which can represent characters, props, scenery, cameras, waypoints, and more. A GameObject’s functionality is defined by the Components attached to it.\nMore info\nSee in\nGlossary\nSDK\nin the\nPhysics\nProject Settings\nNone\nto strip the code of all built-in physics integrations alongside other engine code.\nTo strip the physics integration from your project:\nSelect\nEdit > Project Settings\nto open the Project Settings window.\nSelect the\nPhysics\ntab.\nIn the\nGameObject SDK\ndropdown, select\nNone\n.\nRestart the Editor for your change to take effect.\nAdditional resources\nPhysics\nPhysics integrations in Unity\nPhysics project settings\nPhysics integrations in Unity\nInput\nCopyright ©2005-2026 Unity Technologies. All rights reserved. Built from 6000.3.5f1 (9e864d5a2e6f). Built on: 2026-01-09.\nTutorials\nCommunity Answers\nKnowledge Base\nForums\nAsset Store\nTerms of use\nLegal\nPrivacy Policy\nCookies\nDo Not Sell or Share My Personal Information\nYour Privacy Choices (Cookie Settings)\n",
  "properties": []
}