{
  "name": "manual_graphics_Introduction",
  "type": "manual",
  "description": "",
  "content": "// Unity Manual: Textures_Introduction\n// URL: https://docs.unity3d.com/Manual/Textures.html\n\nMaterials and shaders\nCustom textures\nGet started with textures\nIntroduction to textures\nGet started with textures\nTexture types\nIntroduction to textures\nNormally, the\nmesh\nThe main graphics primitive of Unity. Meshes make up a large part of your 3D worlds. Unity supports triangulated or Quadrangulated polygon meshes. Nurbs, Nurms, Subdiv surfaces must be converted to polygons.\nMore info\nSee in\nGlossary\ngeometry of an object only gives a rough approximation of the shape while most of the fine detail is supplied by\nTextures\nAn image used when rendering a GameObject, Sprite, or UI element. Textures are often applied to the surface of a mesh to give it visual detail.\nMore info\nSee in\nGlossary\n. A texture is just a standard bitmap image that is applied over the mesh surface. You can think of a texture image as though it were printed on a rubber sheet that is stretched and pinned onto the mesh at appropriate positions. The positioning of the texture is done with the 3D modelling software that is used to create the mesh.\nCylinder with tree bark\nUnity can import textures from most common image file formats.\nTerminology\nThis page uses the following terminology:\nBits per\npixel\nThe smallest unit in a computer image. Pixel size depends on your screen resolution. Pixel lighting is calculated at every screen pixel.\nMore info\nSee in\nGlossary\n(bpp)\nis the amount of storage required for a single texture pixel. Textures with a lower bpp value have a smaller size on disk and in memory. A lower bpp value also means that the GPU can store more pixels in its cache, which results in faster texture access.\nLDR (Low Dynamic Range) refers to most typical images where colors are conceptually between 0.0 (black) and 1.0 (white) values. The majority of image files (such as PNG and JPG) have low dynamic range.\nHDR\nhigh dynamic range\nSee in\nGlossary\n(High Dynamic Range) refers to special image and\ntexture formats\nA file format for handling textures during real-time rendering by 3D graphics hardware, such as a graphics card or mobile device.\nMore info\nSee in\nGlossary\nwhere colors can have a higher range than 0 through 1. Image file formats like .exr or .hdr are often used for HDR image data. At runtime and on the GPU, there are several HDR formats, trading off accuracy, range and memory usage.\nRGB\nis a color model in which red, green and blue combine to reproduce an array of colors.\nRGBA\nis a version of\nRGB\nwith an alpha channel, which supports blending and opacity alteration.\nVariable bit rate (VBR)\nmeans that bits per pixel is not a fixed value, and depends on the actual content instead. VBR only applies to\nCrunch\ncompression\nA method of storing data that reduces the amount of storage space it requires. See\nTexture Compression\n,\nAnimation Compression\n,\nAudio Compression\n,\nBuild Compression\n.\nSee in\nGlossary\n, and only texture size on disk. The size in memory is the same as when using the underlying texture format (for example, RGB Compressed DXT1 for RGB Crunched DXT1).\nTextures for use on 3D models\nTextures are applied to objects using\nMaterials\nAn asset that defines how a surface should be rendered.\nMore info\nSee in\nGlossary\n. Materials use specialised graphics programs called\nShaders\nA program that runs on the GPU.\nMore info\nSee in\nGlossary\nto render a texture on the mesh surface. Shaders can implement lighting and colouring effects to simulate shiny or bumpy surfaces among many other things. They can also make use of two or more textures at a time, combining them for even greater flexibility.\nYou should make your textures in dimensions that are to the power of two (e.g. 32x32, 64x64, 128x128, 256x256, etc.) Simply placing them in your project’s Assets folder is sufficient, and they will appear in the Project View.\nOnce your texture has been imported, you should assign it to a\nMaterial\n. The material can then be applied to a mesh,\nParticle System\nA component that simulates fluid entities such as liquids, clouds and flames by generating and animating large numbers of small 2D images in the scene.\nMore info\nSee in\nGlossary\n, or\nGUI Texture\n. Using the\nImport Settings\n, it can also be converted to a\nCubemap\nA collection of six square textures that can represent the reflections in an environment or the skybox drawn behind your geometry. The six squares form the faces of an imaginary cube that surrounds an object; each face represents the view along the directions of the world axes (up, down, left, right, forward and back).\nMore info\nSee in\nGlossary\nor\nNormalmap\nfor different types of applications in the game. For more information about importing textures, please read the\nTexture Component page\n.\n2D graphics\nIn 2D games, the\nSprites\nA 2D graphic objects. If you are used to working in 3D, Sprites are essentially just standard textures but there are special techniques for combining and managing sprite textures for efficiency and convenience during development.\nMore info\nSee in\nGlossary\nare implemented using textures applied to flat meshes that approximate the objects’ shapes.\nSprite from a 3D viewpoint\nAn object in a 2D game may require a set of related graphic images to represent animation frames or different states of a character. Special techniques are available to allow these sets of images to be designed and rendered efficiently. See the manual page about the\nSprite Editor\nfor more information.\nGUI\nA game’s\ngraphic user interface\n(GUI) consists of graphics that are not used directly in the game\nscene\nA Scene contains the environments and menus of your game. Think of each unique Scene file as a unique level. In each Scene, you place your environments, obstacles, and decorations, essentially designing and building your game in pieces.\nMore info\nSee in\nGlossary\nbut are there to allow the player to make choices and see information. For example, the score display and the options menu are typical examples of game GUI. These graphics are clearly very different from the kind used to detail a mesh surface but they are handled using standard Unity textures nevertheless. See the manual chapter on\nGUI Scripting Guide\nfor further details about Unity’s GUI system.\nParticles\nMeshes are ideal for representing solid objects but less suited for things like flames, smoke and sparkles left by a magic spell. This type of effect is handled much better by\nParticle Systems\n. A\nparticle\nis a small 2D graphic representing a small portion of something that is basically fluid or gaseous, such as a smoke cloud. When many of these\nparticles\nA small, simple image or mesh that is emitted by a particle system. A particle system can display and move particles in great numbers to represent a fluid or amorphous entity. The effect of all the particles together creates the impression of the complete entity, such as smoke.\nMore info\nSee in\nGlossary\nare created at once and set in motion, optionally with random variations, they can create a very convincing effect. For example, you might display an explosion by sending particles with a fire texture out at great speed from a central point. A waterfall could be simulated by accelerating water particles downward from a line high in the scene.\nStar particle system\nUnity’s particle systems have a wealth of options for creating all kinds of fluid effects. See the\nmanual chapter\non the subject for further information.\nAnisotropic filtering\nAnisotropic filtering increases Texture quality when viewed from a grazing angle. This rendering is resource-intensive on the graphics card. Increasing the level of anisotropy is usually a good idea for ground and floor Textures. Use\nQuality\nsettings to force anisotropic filtering for all Textures or disable it completely. Although, if a texture has its\nAniso level\nThe anisotropic filtering (AF) level of a texture. Allows you to increase texture quality when viewing a texture at a steep angle. Good for floor and ground textures.\nMore info\nSee in\nGlossary\nset to 0 in\nTexture Import Settings\n, forced anisotropic filtering does not appear on this texture.\nAdditional resources\nEditor GUI and Legacy GUI texture Import Settings window reference\nSprite (2D and UI) texture Import Settings window reference\nGet started with textures\nTexture types\n",
  "properties": []
}