{
  "name": "api_rendering_OcclusionPortal",
  "type": "api",
  "description": "The portal for dynamically changing occlusion at runtime.",
  "content": "// Unity Class: OcclusionPortal\n// Documentation: https://docs.unity3d.com/ScriptReference/OcclusionPortal.html\n\n// Description: The portal for dynamically changing occlusion at runtime.\n\n// Properties:\n// - open: Gets / sets the portal's open state.\n\n// Methods:\n// - BroadcastMessage: Calls the method named methodName on every MonoBehaviour in this game object or any of its children.\n// - CompareTag: Checks the GameObject's tag against the defined tag.\n// - GetComponent: Gets a reference to a component of type T on the same GameObject as the component specified.\n// - GetComponentInChildren: Gets a reference to a component of type T on the same GameObject as the component specified, or any \n// - GetComponentIndex: Gets the index of the component on its parent GameObject.\n// - GetComponentInParent: Gets a reference to a component of type T on the same GameObject as the component specified, or any \n// - GetComponents: Gets references to all components of type T on the same GameObject as the component specified.\n// - GetComponentsInChildren: Gets references to all components of type T on the same GameObject as the component specified, and a\n// - GetComponentsInParent: Gets references to all components of type T on the same GameObject as the component specified, and a\n// - SendMessage: Calls the method named methodName on every MonoBehaviour in this game object.\n// - SendMessageUpwards: Calls the method named methodName on every MonoBehaviour in this game object and on every ancestor o\n// - TryGetComponent: Gets the component of the specified type, if it exists.\n// - GetInstanceID: Gets the instance ID of the object.\n// - ToString: Returns the name of the object.\n// - Destroy: Removes a GameObject, component, or asset.\n// - DestroyImmediate: Destroys the specified object immediately. Use with caution and in Edit mode only.\n// - DontDestroyOnLoad: Do not destroy the target Object when loading a new Scene.\n// - FindAnyObjectByType: Retrieves any active loaded object of Type type.\n// - FindFirstObjectByType: Retrieves the first active loaded object of Type type.\n// - FindObjectsByType: Retrieves a list of all loaded objects of Type type.\n// - Instantiate: Clones the object original and returns the clone.\n// - InstantiateAsync: Captures a snapshot of the original object (that must be related to some GameObject) and returns the\n\npublic class OcclusionPortal {\n    public var open;\n    public void BroadcastMessage();\n    public void CompareTag();\n    public void GetComponent();\n    public void GetComponentInChildren();\n    public void GetComponentIndex();\n    public void GetComponentInParent();\n    public void GetComponents();\n    public void GetComponentsInChildren();\n    public void GetComponentsInParent();\n    public void SendMessage();\n    public void SendMessageUpwards();\n    public void TryGetComponent();\n    public void GetInstanceID();\n    public void ToString();\n    public void Destroy();\n}",
  "properties": [
    {
      "name": "open",
      "description": "Gets / sets the portal's open state."
    },
    {
      "name": "BroadcastMessage",
      "description": "Calls the method named methodName on every MonoBehaviour in this game object or any of its children."
    },
    {
      "name": "CompareTag",
      "description": "Checks the GameObject's tag against the defined tag."
    },
    {
      "name": "GetComponent",
      "description": "Gets a reference to a component of type T on the same GameObject as the component specified."
    },
    {
      "name": "GetComponentInChildren",
      "description": "Gets a reference to a component of type T on the same GameObject as the component specified, or any "
    },
    {
      "name": "GetComponentIndex",
      "description": "Gets the index of the component on its parent GameObject."
    },
    {
      "name": "GetComponentInParent",
      "description": "Gets a reference to a component of type T on the same GameObject as the component specified, or any "
    },
    {
      "name": "GetComponents",
      "description": "Gets references to all components of type T on the same GameObject as the component specified."
    },
    {
      "name": "GetComponentsInChildren",
      "description": "Gets references to all components of type T on the same GameObject as the component specified, and a"
    },
    {
      "name": "GetComponentsInParent",
      "description": "Gets references to all components of type T on the same GameObject as the component specified, and a"
    },
    {
      "name": "SendMessage",
      "description": "Calls the method named methodName on every MonoBehaviour in this game object."
    },
    {
      "name": "SendMessageUpwards",
      "description": "Calls the method named methodName on every MonoBehaviour in this game object and on every ancestor o"
    },
    {
      "name": "TryGetComponent",
      "description": "Gets the component of the specified type, if it exists."
    },
    {
      "name": "GetInstanceID",
      "description": "Gets the instance ID of the object."
    },
    {
      "name": "ToString",
      "description": "Returns the name of the object."
    },
    {
      "name": "Destroy",
      "description": "Removes a GameObject, component, or asset."
    },
    {
      "name": "DestroyImmediate",
      "description": "Destroys the specified object immediately. Use with caution and in Edit mode only."
    },
    {
      "name": "DontDestroyOnLoad",
      "description": "Do not destroy the target Object when loading a new Scene."
    },
    {
      "name": "FindAnyObjectByType",
      "description": "Retrieves any active loaded object of Type type."
    },
    {
      "name": "FindFirstObjectByType",
      "description": "Retrieves the first active loaded object of Type type."
    }
  ]
}