{
  "name": "manual_animation_Animator_component",
  "type": "manual",
  "description": "",
  "content": "// Unity Manual: Animator component\n// Section: Animation\n// URL: https://docs.unity3d.com/Manual/class-Animator.html\n\n// Content:\nAnimation\nMecanim Animation system\nAnimator component\nScripting Root Motion\nAnimator Controller\nAnimator component\nSwitch to Scripting\nUse an\nAnimator component\nA component on a model that animates that model using the Animation system. The component has a reference to an Animator Controller asset that controls the animation.\nMore info\nSee in\nGlossary\nto assign animation to a\nGameObject\nThe fundamental object in Unity scenes, which can represent characters, props, scenery, cameras, waypoints, and more. A GameObject’s functionality is defined by the Components attached to it.\nMore info\nSee in\nGlossary\nin your\nScene\nA Scene contains the environments and menus of your game. Think of each unique Scene file as a unique level. In each Scene, you place your environments, obstacles, and decorations, essentially designing and building your game in pieces.\nMore info\nSee in\nGlossary\n. The Animator component requires a reference to an\nAnimator Controller\nControls animation through Animation Layers with Animation State Machines and Animation Blend Trees, controlled by Animation Parameters. The same Animator Controller can be referenced by multiple models with Animator components.\nMore info\nSee in\nGlossary\nwhich defines which\nanimation clips\nAnimation data that can be used for animated characters or simple animations. It is a simple “unit” piece of motion, such as (one specific instance of) “Idle”, “Walk” or “Run”.\nMore info\nSee in\nGlossary\nto use, and controls when and how to blend and transition between them.\nIf the GameObject is a humanoid character with an\nAvatar\ndefinition, the Avatar should also be assigned in the Animator component.\nThe Animator component with a controller and avatar assigned\nProperties\nProperty\nFunction\nController\nThe animator controller attached to this character.\nAvatar\nAn interface for retargeting animation from one rig to another.\nMore info\nSee in\nGlossary\nThe\nAvatar\nfor this character. (If the Animator is being used to animate a humanoid character)\nApply Root Motion\nSelect whether to control the character’s position and rotation from the animation itself or from script.\nUpdate Mode\nThis allows you to select when the Animator updates, and which timescale it should use.\nNormal\nThe direction perpendicular to the surface of a mesh, represented by a Vector. Unity uses normals to determine object orientation and apply shading.\nMore info\nSee in\nGlossary\n: The Animator is updated in-sync with the Update call, and the animator’s speed matches the current timescale. If the timescale is slowed, animations will slow down to match.\nAnimate Physics\n: The animator is updated in-sync with the FixedUpdate call (i.e. in lock-step with the physics system). You should use this mode if you are animating the motion of objects with physics interactions, such as characters which can push rigidbody objects around.\nUnscaled Time\n: The animator is updated in-sync with the Update call, but the animator’s speed ignores the current timescale and animates at 100% speed regardless. This is useful for animating a GUI system at normal speed while using modified timescales for special effects or to pause gameplay.\nCulling Mode\nThe culling mode you can choose for animations.\nAlways Animate\n: Always animate, don’t do culling even when offscreen.\nCull Update Transforms\n: Retarget, IK and write of Transforms are disabled when renderers are not visible.\nCull Completely\n: Animation is completely disabled when renderers are not visible.\nAnimation curve information\nThe information box at the bottom of the Animator component provides you with a breakdown of the data being used in all the clips used by the Animator Controller.\nAn animation clip contains data in\nanimation curves\nAllows you to add data to an imported clip so you can animate the timings of other items based on the state of an animator. For example, for a game set in icy conditions, you could use an extra animation curve to control the emission rate of a particle system to show the player’s condensing breath in the cold air.\nMore info\nSee in\nGlossary\n, which represent how a value changes over time. These curves may describe the position or rotation of an object, the flex of a muscle in the\nhumanoid animation\nAn animation using humanoid skeletons. Humanoid models generally have the same basic structure, representing the major articulate parts of the body, head and limbs. This makes it easy to map animations from one humanoid skeleton to another, allowing retargeting and inverse kinematics.\nMore info\nSee in\nGlossary\nsystem, or other animated values within the clip such as a changing material color.\nThis table explains what each item of data represents:\nLabel\nDescription\nClip Count\nThe total number of animation clips used by the animator controller assigned to this Animator.\nCurves (Pos, Rot & Scale)\nThe total number of curves Unity uses to animate the position, rotation or scale of GameObjects. These are for animated GameObjects that are not part of a standard humanoid rig. When animating a humanoid avatar, these curves would show up a count for extra non-muscle bones such as a tail, flowing cloth or a dangling pendant. If you have a humanoid animation and you notice unexpected non-muscle animation curves, you might have unnecessary animation curves in your animation files.\nMuscles\nThe number of muscle animation curves used for humanoid animation by this Animator. These are the curves used to animate the standard humanoid avatar muscles. As well as the standard muscle movements for all the humanoid bones in Unity’s standard avatar, this also includes two “muscle curves” which store the\nroot motion\nMotion of character’s root node, whether it’s controlled by the animation itself or externally.\nMore info\nSee in\nGlossary\nposition and rotation animation.\nGeneric\nThe number of numeric (float) curves used by the animator to animate other properties such as material color.\nPPtr\nThe total count of\nsprite\nA 2D graphic objects. If you are used to working in 3D, Sprites are essentially just standard textures but there are special techniques for combining and managing sprite textures for efficiency and convenience during development.\nMore info\nSee in\nGlossary\nanimation curves (used by Unity’s 2d system)\nCurves Count\nThe total combined number of animation curves\nConstant\nThe number of animation curves that are optimized as constant (unchanging) values. Unity selects this automatically if your animation files contain curves with unchanging values.\nDense\nThe number of animation curves that are optimized using the dense method of storing data (discrete values which are interpolated between linearly). This method uses significantly less memory than the stream method.\nStream\nThe number of animation curves using the stream method of storing data (values with time and tangent data for curved interpolation). This data occupies significantly more memory than the dense method.\nIf your animation clips are imported with\nAnim.\nCompression\nA method of storing data that reduces the amount of storage space it requires. See\nTexture Compression\n,\nAnimation Compression\n,\nAudio Compression\n,\nBuild Compression\n.\nSee in\nGlossary\nset to\nOptimal\nin the\nAnimation import reference\n, Unity will use a heuristic algorithm to determine whether it is best to use the dense or stream method to store the data for each curve.\nScripting Root Motion\nAnimator Controller\nCopyright ©2005-2026 Unity Technologies. All rights reserved. Built from 6000.3.5f1 (9e864d5a2e6f). Built on: 2026-01-09.\nTutorials\nCommunity Answers\nKnowledge Base\nForums\nAsset Store\nTerms of use\nLegal\nPrivacy Policy\nCookies\nDo Not Sell or Share My Personal Information\nYour Privacy Choices (Cookie Settings)\n",
  "properties": []
}