{
  "name": "manual_graphics_effects",
  "type": "manual",
  "description": "",
  "content": "// Unity Manual Page: visual effects\n// URL: https://docs.unity3d.com/Manual/visual-effects.html\n// Content Length: 2377 characters\n\n// Manual Content:\nVisual effects Shader Import Settings window reference Particle effects Visual effects This section provides information on the visual effects available in Unity. Scene that uses post-processing effects. Topic Description Particle systems A component that simulates fluid entities such as liquids, clouds and flames by generating and animating large numbers of small 2D images in the scene. More info See in Glossary How to choose between Unity’s different particle A small, simple image or mesh that is emitted by a particle system. A particle system can display and move particles in great numbers to represent a fluid or amorphous entity. The effect of all the particles together creates the impression of the complete entity, such as smoke. More info See in Glossary systems, and use them in your project. Decals How to create decal and projector effects. Lens flares A component that simulates the effect of lights refracting inside a camera lens. Use a Lens Flare to represent very bright lights or add atmosphere to your scene. More info See in Glossary How to create lens flare. Light halos How to create halo effects. Line and trail effects How to render lines, trails, and billboards A textured 2D object that rotates so that it always faces the Camera. More info See in Glossary . Visual Effect Graph package reference Reference resources for the Visual Effect Graph package. Additional resources and examples 📖 E-Book : The definitive guide to creating advanced visual effects in Unity (Unity 6 edition) 📖 E-Book : Create popular shaders and visual effects with the Universal Render Pipeline (Unity 6 edition) 📖 E-Book : Introduction to the Universal Render Pipeline for advanced creators (Unity 6 edition) 📺 Video : Compute shaders - Part 1: Particle fun 📺 Video : Compute shaders - Part 2: Flocking 📺 Video : Compute shaders - Part 3: Vertex animation 📺 Video : Introduction to the Render Graph in Unity 6 📺 Video : VFX Graph Learning Templates 📺 Video : Understanding URP settings and essentials Shader Import Settings window reference Particle effects Copyright ©2005-2026 Unity Technologies. All rights reserved. Built from 6000.3.5f1 (9e864d5a2e6f). Built on: 2026-01-09. Tutorials Community Answers Knowledge Base Forums Asset Store Terms of use Legal Privacy Policy Cookies Do Not Sell or Share My Personal Information Your Privacy Choices (Cookie Settings)\n",
  "properties": []
}