{
  "name": "manual_audio_Tracker_modules",
  "type": "manual",
  "description": "",
  "content": "// Unity Manual: Tracker modules\n// Section: Audio\n// URL: https://docs.unity3d.com/Manual/TrackerModules.html\n\n// Content:\nAudio\nTracker Modules\nExample: Create a root output\nAudio Mixer\nTracker Modules\nTracker Modules are essentially just packages of audio samples that have been modeled, arranged and sequenced programatically. The concept was introduced in the 1980’s (mainly in conjunction with the Amiga computer) and has been popular since the early days of game development and demo culture.\nTracker Module files are similar to MIDI files in many ways. The tracks are scores that contain information about when to play the instruments, and at what pitch and volume and from this, the melody and rhythm of the original tune can be recreated. However, MIDI has a disadvantage in that the sounds are dependent on the sound bank available in the audio hardware, so MIDI music can sound different on different computers. In contrast, tracker modules include high quality PCM samples that ensure a similar experience regardless of the audio hardware in use.\nSupported formats\nUnity supports the four most common module file formats, namely Impulse Tracker (\n.it\n), Scream Tracker (\n.s3m\n), Extended Module File Format (\n.xm\n), and the original Module File Format (\n.mod\n).\nBenefits of Using Tracker Modules\nTracker module files differ from mainstream PCM formats (\n.aif\n,\n.wav\n,\n.mp3\n, and\n.ogg\n) in that they can be very small without a corresponding loss of sound quality. A single sound sample can be modified in pitch and volume (and can have other effects applied), so it essentially acts as an “instrument” which can play a tune without the overhead of recording the whole tune as a sample. As a result, tracker modules lend themselves to games, where music is required but where a large file download would be a problem.\nThird Party Tools and Further References\nCurrently, the most popular tools to create and edit Tracker Modules are MilkyTracker for macOS and OpenMPT for Windows.\nExample: Create a root output\nAudio Mixer\nCopyright ©2005-2026 Unity Technologies. All rights reserved. Built from 6000.3.5f1 (9e864d5a2e6f). Built on: 2026-01-09.\nTutorials\nCommunity Answers\nKnowledge Base\nForums\nAsset Store\nTerms of use\nLegal\nPrivacy Policy\nCookies\nDo Not Sell or Share My Personal Information\nYour Privacy Choices (Cookie Settings)\n",
  "properties": []
}