{
  "name": "manual_other_MultiScene",
  "type": "manual",
  "description": "",
  "content": "// Unity Manual: Scenes_MultiScene\n// URL: https://docs.unity3d.com/Manual/MultiSceneEditing.html\n\nScenes\nWork with multiple scenes in Unity\nCreating, loading, and saving scenes\nSet up multiple scenes\nWork with multiple scenes in Unity\nIf you need to create large streaming worlds or want to effectively manage multiple\nscenes\nA Scene contains the environments and menus of your game. Think of each unique Scene file as a unique level. In each Scene, you place your environments, obstacles, and decorations, essentially designing and building your game in pieces.\nMore info\nSee in\nGlossary\nat runtime, you can open and edit multiple scenes in the Unity Editor simultaneously. Having multiple scenes open at once also lets you improve the workflow, especially if you often have to edit scenes collaboratively.\nTopic\nDescription\nSetup multiple scenes\nHow to setup, view, and edit settings with multiple scenes in your project.\nBake data in multiple scenes\nHow to bake\nlightmaps\nA pre-rendered texture that contains the effects of light sources on static objects in the scene. Lightmaps are overlaid on top of scene geometry to create the effect of lighting.\nMore info\nSee in\nGlossary\n,\nNavMesh\nA mesh that Unity generates to approximate the walkable areas and obstacles in your environment for path finding and AI-controlled navigation.\nMore info\nSee in\nGlossary\ndata, and\nocclusion culling\nA process that disables rendering GameObjects that are hidden (occluded) from the view of the camera.\nMore info\nSee in\nGlossary\ndata in multiple scenes simultaneously.\nUse scripts to edit multiple scenes\nHow to edit multiple scenes with\nscripts\nA piece of code that allows you to create your own Components, trigger game events, modify Component properties over time and respond to user input in any way you like.\nMore info\nSee in\nGlossary\n, through the Editor or at runtime.\nAdditional resources\nCreating, loading, and saving Scenes\nCreating, loading, and saving scenes\nSet up multiple scenes\n",
  "properties": []
}