{
  "name": "manual_2d_2D_2D_and_3D_Projects",
  "type": "manual",
  "description": "",
  "content": "// Unity Manual: 2D and 3D Projects\n// Section: 2D\n// URL: https://docs.unity3d.com/Manual/2Dor3D.html\n\n// Content:\nUnity for first-time users\n2D and 3D projects\nCreate your first project\nGetting started with AI in Unity\n2D and 3D projects\nUnity is equally suited to creating both 2D and 3D games. When you create a new project, you choose either 2D or 3D mode. You may already know what you want to build, but there are a few subtle points that may affect which mode you choose.\nThe choice between starting in 2D or 3D mode determines some settings for the Unity Editor, such as whether images are imported as textures or\nsprites\nA 2D graphic objects. If you are used to working in 3D, Sprites are essentially just standard textures but there are special techniques for combining and managing sprite textures for efficiency and convenience during development.\nMore info\nSee in\nGlossary\n. You can swap between 2D or 3D mode at any time regardless of the mode you set when you created your project (see\n2D and 3D Mode Settings\n). Here are some guidelines which should help you choose.\nFull 3D\nSome 3D scenes from Unity’s sample projects on the Asset Store\n3D games usually make use of three-dimensional geometry, with Materials and Textures rendered on the surface of\nGameObjects\nThe fundamental object in Unity scenes, which can represent characters, props, scenery, cameras, waypoints, and more. A GameObject’s functionality is defined by the Components attached to it.\nMore info\nSee in\nGlossary\nto make them appear as solid environments, characters and objects that make up your game world. The Camera can move in and around the\nScene\nA Scene contains the environments and menus of your game. Think of each unique Scene file as a unique level. In each Scene, you place your environments, obstacles, and decorations, essentially designing and building your game in pieces.\nMore info\nSee in\nGlossary\nfreely, with light and shadows cast around the world in a realistic way. 3D games usually render the Scene using perspective, so objects appear larger on screen as they get closer to the camera. For all games that fit this description, start in\n3D\nmode.\nOrthographic 3D\nSome 3D games using an Orthographic view. Images created using assets from\nSynty Studios\nand\nBITGEM\nSometimes games use 3D geometry, but use an orthographic camera instead of perspective. This is a common technique used in games which give you a bird’s-eye view of the action, and is sometimes called “2.5D”. If you’re making a game like this, you should also use the Editor in\n3D\nmode, because even though there is no\nperspective\n, you will still be working with 3D models and Assets. You’ll need to switch your\nCamera\nA component which creates an image of a particular viewpoint in your scene. The output is either drawn to the screen or captured as a texture.\nMore info\nSee in\nGlossary\nand\nScene view\nAn interactive view into the world you are creating. You use the Scene View to select and position scenery, characters, cameras, lights, and all other types of Game Object.\nMore info\nSee in\nGlossary\nto\nOrthographic\nthough.\nFull 2D\nSome examples of typical 2D game types\nMany 2D games use flat graphics, sometimes called sprites, which have no three-dimensional geometry at all. They are drawn to the screen as flat images, and the game’s camera has no perspective. For this type of game, you should start the editor in\n2D\nmode.\n2D gameplay with 3D graphics\nA side scrolling game with 2D gameplay, but 3d graphics\nSome 2D games use 3D geometry for the environment and characters, but restrict the\ngameplay\nto two dimensions. For example, the camera may show a side-scrolling view, and the player can only move in two dimensions, but the game itself still uses 3D models for the obstacles and a 3D perspective for the camera. For these games, the 3D effect may serve a stylistic rather than functional purpose. This type of game is\nalso\nsometimes referred to as “2.5D”. Although the gameplay is 2D, you are mostly manipulating 3D models to build the game, so you should start the editor in\n3D\nmode.\n2D gameplay and graphics with a perspective camera\nA 2D “cardboard theatre” style game, giving a parallax movement effect. Image created using an asset by\nOne Point Six Studio\n, available on the Unity Asset Store.\nThis is another popular style of 2D game, using 2D graphics but with a perspective camera to get a parallax scrolling effect. This is a “cardboard theater”-style scene, where all graphics are flat, but arranged at different distances from the camera. It’s most likely that\n2D\nmode will suit your development in this case. However, you should change your\nCamera’s\nprojection mode to\nPerspective\nand the\nScene view\nmode to\n3D\n.\nAdditional resources\nXR\nAn umbrella term encompassing Virtual Reality (VR), Augmented Reality (AR) and Mixed Reality (MR) applications. Devices supporting these forms of interactive applications can be referred to as XR devices.\nMore info\nSee in\nGlossary\nCreate your first project\nGetting started with AI in Unity\nCopyright ©2005-2026 Unity Technologies. All rights reserved. Built from 6000.3.5f1 (9e864d5a2e6f). Built on: 2026-01-09.\nTutorials\nCommunity Answers\nKnowledge Base\nForums\nAsset Store\nTerms of use\nLegal\nPrivacy Policy\nCookies\nDo Not Sell or Share My Personal Information\nYour Privacy Choices (Cookie Settings)\n",
  "properties": []
}