{
  "name": "manual_ui_More_info",
  "type": "manual",
  "description": "",
  "content": "// Unity Manual: More info\n// Section: UI\n// URL: https://docs.unity3d.com/Manual/UsingTheInspector.html\n\n// Content:\nThe Editor interface\nThe Inspector window\nHierarchy window reference\nManage the Inspector window\nThe Inspector window\nThe\nInspector\nwindow displays the properties of the current selection of one or more GameObjects, assets, or components. You can use the\nInspector\nwindow to view and edit the properties of the selected items.\nTopic\nDescription\nManage the Inspector window\nOpen the\nInspector\nwindow in normal or debug mode.\nInspect items\nLearn what the\nInspector\nwindow displays for GameObjects, prefabs, assets, and\nscripts\nA piece of code that allows you to create your own Components, trigger game events, modify Component properties over time and respond to user input in any way you like.\nMore info\nSee in\nGlossary\n.\nFocus an Inspector window\nKeep the window focused on a single item, regardless of the current selection.\nAssign icons to inspected items\nAssign built-in or custom icons to display on the item in the\nScene\nA Scene contains the environments and menus of your game. Think of each unique Scene file as a unique level. In each Scene, you place your environments, obstacles, and decorations, essentially designing and building your game in pieces.\nMore info\nSee in\nGlossary\nview\n.\nManage components and their values\nEdit component properties.\nAdditional resources\nInspecting scripts\nGameObjects\nThe fundamental object in Unity scenes, which can represent characters, props, scenery, cameras, waypoints, and more. A GameObject’s functionality is defined by the Components attached to it.\nMore info\nSee in\nGlossary\nComponents\nA functional part of a GameObject. A GameObject can contain any number of components. Unity has many built-in components, and you can create your own by writing scripts that inherit from MonoBehaviour.\nMore info\nSee in\nGlossary\nPrefabs\nAn asset type that allows you to store a GameObject complete with components and properties. The prefab acts as a template from which you can create new object instances in the scene.\nMore info\nSee in\nGlossary\nThe Hierarchy window\nHierarchy window reference\nManage the Inspector window\nCopyright ©2005-2026 Unity Technologies. All rights reserved. Built from 6000.3.5f1 (9e864d5a2e6f). Built on: 2026-01-09.\nTutorials\nCommunity Answers\nKnowledge Base\nForums\nAsset Store\nTerms of use\nLegal\nPrivacy Policy\nCookies\nDo Not Sell or Share My Personal Information\nYour Privacy Choices (Cookie Settings)\n",
  "properties": []
}