{
  "name": "manual_ui_Comparison_of_UI_systems_in_Unity",
  "type": "manual",
  "description": "",
  "content": "// Unity Manual: Comparison of UI systems in Unity\n// Section: UI\n// URL: https://docs.unity3d.com/Manual/UI-system-compare.html\n\n// Content:\nUI systems\nComparison of UI systems in Unity\nUI systems\nUI Toolkit\nComparison of UI systems in Unity\nUI Toolkit\nis intended to become the recommended UI system for you to develop UI in your projects. However, in its current release, UI Toolkit does not have some features that\nuGUI (Unity UI)\nand\nIMGUI (Immediate Mode GUI)\nsupport. uGUI and IMGUI are more appropriate for certain use cases, and are required to support legacy projects.\nThis page provides a high-level feature comparison of UI Toolkit, uGUI, and IMGUI, and their respective approaches to UI design.\nGeneral consideration\nThe following table lists the recommended and alternative system for runtime and Editor:\nUnity 6.3\nRecommendation\nAlternative\nRuntime\nuGUI (Unity UI)\nUI Toolkit\nEditor\nUI Toolkit\nIMGUI\nRoles and skill sets\nYour team’s skill set and comfort level with different technologies is also an important consideration.\nThe following table lists the recommended system for different roles:\nRoles\nUI Toolkit\nuGUI (Unity UI)\nIMGUI\nSkill sets\nProgrammer\n✅\n✅\n✅\nProgrammers can use any game development tool or API.\nTechnical Artist\nPartial\n✅\n❌\nTechnical artists who are familiar with Unity’s GameObject-based tools and workflows are likely to be comfortable working with GameObjects, Components, and the Scene view.\nThey might not be comfortable with UI Toolkit’s web-like approach or IMGUI’s pure C# approach.\nUI Designer\n✅\nPartial\n❌\nUI designers who are familiar with UI creation tools are likely to be comfortable with UI Toolkit’s document-based approach and can use the\nUI Builder\nto visually edit their UI.\nIf they are not familiar with GameObject-based workflows, they might require help from programmers or level designers.\nInnovation and development\nUI Toolkit is in active development and releases new features frequently. uGUI and IMGUI are established and production-proven UI systems that are updated infrequently.\nuGUI and IMGUI might be better choices if you need features that are not yet available in UI Toolkit, or you need to support or reuse older UI content.\nRuntime\nUI Toolkit is an alternative to uGUI (Unity UI) if you create a screen overlay UI that runs on a wide variety of screen resolutions. Consider UI Toolkit to do the following:\nProduce work with a significant amount of user interfaces\nRequire familiar authoring workflows for artists and designers\nSeek textureless UI rendering capabilities\nUI positioned and lit in a 3D world\nAdvanced visuals with custom\nshaders\nA program that runs on the GPU.\nMore info\nSee in\nGlossary\nand materials\nuGUI is the recommended solution for the following:\nEasy referencing from\nMonoBehaviours\nUse Cases\nThe following table lists the recommended system for major runtime use cases:\nUnity 6.3\nRecommendation\nMulti-resolution menus and HUD in intensive UI projects\nUI Toolkit\nWorld space UI and\nVR\nVirtual Reality\nMore info\nSee in\nGlossary\nUI Toolkit\nUI that requires customized shaders and materials\nUI Toolkit\nUI that requires keyframed animations\nuGUI\nIn details\nThe following table lists the recommended system for detailed runtime features:\nUnity 6.3\nUI Toolkit\nuGUI\nWYSIWYG\nWhat You See Is What You Get. A term used to describe a system where the user interface closely resembles the final output.\nSee in\nGlossary\nauthoring\n✅\n✅\nNesting reusable components\n✅\n✅\nLayout and Styling Debugger\n✅\n✅\nIn-scene authoring\n❌\n✅\nRich text tags\n✅\n✅\nScalable text\n✅\n✅\nFont fallbacks\n✅\n✅\nAdaptive layout\n✅\n✅\nInput system\nsupport\n✅\n✅\nSerialized events\n❌\n✅\nCompatible with\nRendering pipelines\n✅\n✅\nScreen-space (2D) rendering\n✅\n✅\nWorld-space (3D) rendering\n✅\n✅\nCustom materials and shaders\n✅\n✅\nSprites\nA 2D graphic objects. If you are used to working in 3D, Sprites are essentially just standard textures but there are special techniques for combining and managing sprite textures for efficiency and convenience during development.\nMore info\nSee in\nGlossary\n/\nSprite atlas\nGraphics:\nA utility that packs several sprite textures tightly together within a single texture known as an atlas.\nMore info\n.\n2D:** A texture that is composed of several smaller textures. Also referred to as a texture atlas, image sprite, sprite sheet or packed texture.\nMore info\n.\nSee in\nGlossary\nsupport**\n✅\n✅\nRectangle clipping\n✅\n✅\nMask clipping\n✅\n✅\nNested masking\n✅\n✅\nIntegration with\nAnimation Clips\nAnimation data that can be used for animated characters or simple animations. It is a simple “unit” piece of motion, such as (one specific instance of) “Idle”, “Walk” or “Run”.\nMore info\nSee in\nGlossary\nand Timeline\n❌\n✅\nData binding system\n✅\n❌\nUI transition animations\n✅\n❌\nTextureless elements\n✅\n❌\nAdvanced flexible layout\n✅\n❌\nGlobal style management\n✅\n❌\nDynamic texture atlas\n✅\n❌\nUI anti-aliasing\n✅\n❌\nRight-to-left language\nand emoji\n✅\n❌\nSVG support\n✅\n❌\nEditor\nUI Toolkit is recommended if you create complex editor tools. UI Toolkit is also recommended for the following reasons:\nBetter reusability and decoupling\nVisual tools for authoring UI\nBetter scalability for code maintenance and performance\nIMGUI is an alternative to UI Toolkit for the following:\nUnrestricted access to editor extensible capabilities\nLight API to quickly render UI on screen\nUse Cases\nThe following table lists the recommended system for major Editor use cases:\nUnity 6.3\nRecommendation\nComplex editor tool\nUI Toolkit\nProperty drawers\nA Unity feature that allows you to customize the look of certain controls in the Inspector window by using attributes on your scripts, or by controlling how a specific Serializable class should look\nMore info\nSee in\nGlossary\nUI Toolkit\nCollaboration with designers\nUI Toolkit\nIn details\nThe following table lists the recommended system for detailed Editor features:\nUnity 6.3\nUI Toolkit\nIMGUI\nWYSIWYG authoring\n✅\n❌\nNesting reusable components\n✅\n❌\nGlobal style management\n✅\n✅\nLayout and Styling Debugger\n✅\n❌\nRich text tags\n✅\n✅\nScalable text\n✅\n❌\nFont fallbacks\n✅\n✅\nAdaptive layout\n✅\n✅\nDefault\nInspectors\nA Unity window that displays information about the currently selected GameObject, asset or project settings, allowing you to inspect and edit the values.\nMore info\nSee in\nGlossary\n✅\n✅\nInspector: Edit custom object types\n✅\n✅\nInspector: Edit custom property types\n✅\n✅\nInspector: Mixed values (multi-editing) support\n✅\n✅\nArray and list-view control\n✅\n✅\nData binding: Serialized properties\n✅\n✅\nAdvanced flexible layout\n✅\n❌\nRight-to-left language\nand emoji\n✅\n❌\nSVG support\n.\n✅\n❌\nAdditional resources\nMigrate from uGUI to UI Toolkit\nMigrate from IMGUI to UI Toolkit\nUI systems\nUI Toolkit\nCopyright ©2005-2026 Unity Technologies. All rights reserved. Built from 6000.3.5f1 (9e864d5a2e6f). Built on: 2026-01-09.\nTutorials\nCommunity Answers\nKnowledge Base\nForums\nAsset Store\nTerms of use\nLegal\nPrivacy Policy\nCookies\nDo Not Sell or Share My Personal Information\nYour Privacy Choices (Cookie Settings)\n",
  "properties": []
}