{
  "name": "manual_graphics_Overview",
  "type": "manual",
  "description": "",
  "content": "// Unity Manual: Cameras_Overview\n// URL: https://docs.unity3d.com/Manual/CamerasOverview.html\n\nCameras\nIntroduction to cameras\nCameras\nThe camera view\nIntroduction to cameras\nJust as cameras are used in films to display the story to the audience,\nCameras\nin Unity are used to display the game world to the player.\nA Unity\nscene\nA Scene contains the environments and menus of your game. Think of each unique Scene file as a unique level. In each Scene, you place your environments, obstacles, and decorations, essentially designing and building your game in pieces.\nMore info\nSee in\nGlossary\nrepresents\nGameObjects\nThe fundamental object in Unity scenes, which can represent characters, props, scenery, cameras, waypoints, and more. A GameObject’s functionality is defined by the Components attached to it.\nMore info\nSee in\nGlossary\nin a three-dimensional space. Since the viewer’s screen is two-dimensional, Unity needs to capture a view and “flatten” it for display. It does this using cameras.\nCameras can be customized, scripted, or parented to achieve just about any kind of effect imaginable. For a puzzle game, you might keep the Camera static for a full view of the puzzle. For a first-person shooter, you would parent the Camera to the player character, and place it at the character’s eye level. For a racing game, you’d probably have the Camera follow your player’s vehicle.\nBy customizing and manipulating cameras, you can make the presentation of your game truly unique. You will always have at least one camera in a scene, but you can have more than one. You can have an unlimited number of cameras in a scene. They can be set to render in any order, at any place on the screen, or only certain parts of the screen.\nIn Unity, you create a camera by adding a\nCamera component\nto a GameObject.\nPerspective and orthographic cameras\nThe same scene shown in perspective mode (left) and orthographic mode (right)\nA camera in the real world, or indeed a human eye, sees the world in a way that makes objects look smaller the farther they are from the point of view. This well-known\nperspective\neffect is widely used in art and computer graphics and is important for creating a realistic scene. Naturally, Unity supports perspective cameras, but for some purposes, you want to render the view without this effect. For example, you might want to create a map or information display that is not supposed to appear exactly like a real-world object. A camera that does not diminish the size of objects with distance is referred to as\northographic\nand Unity cameras also have an option for this. The perspective and orthographic modes of viewing a scene are known as camera\nprojections\n.\n(scene above from\nBITGEM\n)\nMarking a Camera as\nOrthographic\nremoves all perspective from the Camera’s view. This is mostly useful for making isometric or 2D games.\nNote that fog is rendered uniformly in orthographic camera mode and may therefore not appear as expected. This is because the Z coordinate of the post-perspective space is used for the fog “depth”. This is not strictly accurate for an orthographic camera but it is used for its performance benefits during rendering.\nRender path\nUnity supports different rendering paths. You should choose which one you use depending on your game content and target platform / hardware. Different rendering paths have different features and performance characteristics that mostly affect lights and shadows.\n\nThe rendering path used by your Project is chosen in the\nPlayer\nsettings. Additionally, you can override it for each Camera.\nFor more information on rendering paths, check the\nrendering paths\nThe technique that a render pipeline uses to render graphics. Choosing a different rendering path affects how lighting and shading are calculated. Some rendering paths are more suited to different platforms and hardware than others.\nMore info\nSee in\nGlossary\npage.\nAdditional resources\nIntroduction to cameras in URP\nCamera render types in URP\nCamera render order in URP\nCamera Inspector windows reference for URP\nCamera Inspector window reference for the Built-In Render Pipeline\nCameras\nThe camera view\n",
  "properties": []
}