{
  "name": "manual_platforms_Overview",
  "type": "manual",
  "description": "",
  "content": "// Unity Manual: Platforms_Overview\n// URL: https://docs.unity3d.com/Manual/PlatformSpecific.html\n\nPlatform development\nUse the Multiplayer Center\nCross-platform features and considerations\nPlatform development\nImportant\n: A critical security vulnerability has been identified affecting games and applications built with Unity 2017.1 and later for Android, Windows, macOS, and Linux. To learn more about this vulnerability and the action you must take, refer to\nUnity Platform Protection: Developer Remediation Guide\n.\nBefore starting out with the Unity Editor, you might want to familiarize yourself with the platforms that you can create your projects in. Unity supports most of the leading desktop, web, and mobile platforms as follows:\nTopic\nDescription\nCross-platform features and considerations\nLists the features that are applicable across multiple platforms.\nAndroid\nIncludes information about the concepts, requirements, settings among other essential details required to develop Unity applications on Android platform.\nDedicated Server\nProvides information about developing Unity applications on Dedicated Server platform that you can use to develop multiplayer games.\nEmbedded systems\nIncludes information about developing Unity applications for embedded systems, such as Embedded Linux and QNX.\niOS\nExplains about developing Unity applications on the iOS mobile platform using tools, settings, and iOS-specific development information.\nLinux\nIncludes information about developing Unity applications on the Linux desktop platform that includes settings available in the Unity Editor for Linux platform, Linux Player build binaries, and troubleshooting.\nmacOS\nExplains how to build and develop Unity applications on the macOS platform along with the macOS settings in the Unity Editor.\ntvOS\nIncludes tvOS requirements and compatibility, Unity Editor\nPlayer settings\nSettings that let you set various player-specific options for the final game built by Unity.\nMore info\nSee in\nGlossary\ninformation that you can use while developing Unity applications on tvOS platform.\nUWP\nExplains how to develop, build, and deliver Unity applications on Universal Windows Platform.\nvisionOS\nIncludes information about the requirements and how to get started with developing Unity applications on visionOS platform.\nWeb\nExplains how to develop Unity applications for the Web platform and includes information about compatibility, limitations, and Unity Editor settings. Also includes guidance about developing for Facebook Instant Games.\nWindows\nIncludes information about the tools and settings to develop Unity applications on Windows platform.\nNote:\nIf you are a developer with access to\nClosed platforms\nIncludes platforms that require confidentiality and legal agreements with the platform provider for using their developer tools and hardware. These platforms aren’t open to development unless you have an established relationship with the provider. For example PlayStation®, Game Core for Xbox®, and Nintendo®.\nSee in\nGlossary\n, you might have more platform options after you download and register your preferred platform setup. For more information, visit the\nPlatform Module Installation\npage.\nFor a full list of platforms that Unity supports and to know the minimum system requirements for these platforms, refer to\nSystem Requirements\n.\nAdditional resources and examples\n💡\nResources\n:\nTarget platforms roadmap\n👥\nCommunity\n:\nJoin the conversation on Unity Discussions for Platforms\n📖\nE-Book\n:\nCreate virtual and mixed reality experiences in Unity\n📖\nE-Book\n:\nOptimize your game performance for mobile, XR, and Web in Unity (Unity 6)\n📖\nE-Book\n:\nOptimize your game performance for consoles and PCs in Unity (Unity 6)\nUse the Multiplayer Center\nCross-platform features and considerations\n",
  "properties": []
}