{
  "name": "manual_audio_Ambisonic_audio",
  "type": "manual",
  "description": "",
  "content": "// Unity Manual: Ambisonic audio\n// Section: Audio\n// URL: https://docs.unity3d.com/Manual/AmbisonicAudio.html\n\n// Content:\nAudio\nAmbisonic Audio\nAudio Profiler module reference\nDevelop an ambisonic audio decoder\nAmbisonic Audio\nAmbisonics are a type of audio that provide a representation of sound that can completely surround a listener. They can provide an audio\nskybox\nA special type of Material used to represent skies. Usually six-sided.\nMore info\nSee in\nGlossary\nfor distant ambient sounds, and are particularly useful for 360-degree videos and applications.\nAmbisonics are stored in a multi-channel format. Instead of mapping each channel to a specific speaker, ambisonics represent the soundfield in a more general way. You can rotate the soundfield based on the listener’s orientation (such as the user’s head rotation in VR). You can also decode the soundfield into a format that matches the speaker setup.\nSelecting an ambisonic audio decoder\nTo select an ambisonic audio decoder in your project, open your project’s\nAudio\nsettings (menu:\nEdit\n>\nProject Settings\n>\nAudio\n). Select an\nAmbisonic Decoder Plugin\nfrom the list of available decoders in the project.\nAmbisonic options in the Audio settings\nThere are no built-in decoders included with Unity, but you can do one of the following options:\nYou can create your own ambisonic audio decoder\nplug-in\nA set of code created outside of Unity that creates functionality in Unity. There are two kinds of plug-ins you can use in Unity: Managed plug-ins (managed .NET assemblies created with tools like Visual Studio) and Native plug-ins (platform-specific native code libraries).\nMore info\nSee in\nGlossary\n. For more information, refer to\nAmbisonic Audio Decoder\n.\nUse external decoders. For instance, some\nVR\nVirtual Reality\nMore info\nSee in\nGlossary\nhardware manufacturers provide them in their audio SDKs for Unity. Check your target platform manufacturer’s documentation to learn if this is available for your project.\nImporting an ambisonic audio clip\nTo import an ambisonic\naudio clip\nA container for audio data in Unity. Unity supports mono, stereo and multichannel audio assets (up to eight channels). Unity can import .aif, .wav, .mp3, and .ogg audio file format, and .xm, .mod, .it, and .s3m tracker module formats.\nMore info\nSee in\nGlossary\n, import a multi-channel B-format WAV file with ACN component ordering, and SN3D normalization. In the\nInspector\nA Unity window that displays information about the currently selected GameObject, asset or project settings, allowing you to inspect and edit the values.\nMore info\nSee in\nGlossary\nwindow for the audio clip, enable\nAmbisonic\n.\nThe Ambisonic option in the audio clip inspector\nPlaying the ambisonic audio clip through an Audio Source\nTo play an ambisonic audio clip through an\nAudio Source\nA component which plays back an Audio Clip in the scene to an audio listener or through an audio mixer.\nMore info\nSee in\nGlossary\n:\nAssign the WAV file as an\nAudio Clip\non an Audio Source.\nDisable the\nSpatialize\noption. When you play an ambisonic audio clip, it is automatically decoded through the project’s selected ambisonic audio decoder. The decoder converts the clip from ambisonic format to the project’s selected speaker format. It also already handles spatialization as a part of this decoding operation, based on the orientation of the audio source and\naudio listener\nA component that acts like a microphone, receiving sound from Audio Sources in the scene and outputting to the computer speakers.\nMore info\nSee in\nGlossary\n.\nWhen Unity plays an ambisonic audio clip, it decompresses the file, if necessary, then decodes it to convert it to the project’s selected speaker mode. It then applies the Audio Source’s effects.\nNote:\nReverb zones are disabled for ambisonic audio clips.\nAudio Profiler module reference\nDevelop an ambisonic audio decoder\nCopyright ©2005-2026 Unity Technologies. All rights reserved. Built from 6000.3.5f1 (9e864d5a2e6f). Built on: 2026-01-09.\nTutorials\nCommunity Answers\nKnowledge Base\nForums\nAsset Store\nTerms of use\nLegal\nPrivacy Policy\nCookies\nDo Not Sell or Share My Personal Information\nYour Privacy Choices (Cookie Settings)\n",
  "properties": []
}