{
  "name": "manual_animation_More_info",
  "type": "manual",
  "description": "",
  "content": "// Unity Manual: More info\n// Section: Animation\n// URL: https://docs.unity3d.com/Manual/FeatureSets.html\n\n// Content:\nPackages and package management\nFeature sets\nDeprecated packages\n2D feature set\nFeature sets\nFeature sets are groups of\npackages\nA container that stores various types of features and assets for Unity, including Editor or Runtime tools and libraries, Asset collections, and project templates. Packages are self-contained units that the Unity Package Manager can share across Unity projects. Most of the time these are called\npackages\n, but occasionally they are called\nUnity Package Manager (UPM) packages\n. The\nUnity Package Manager\n(UPM) can display, add, and remove packages from your project. These packages are native to the Unity Package Manager and provide a fundamental method of delivering Unity functionality. However, the Unity Package Manager can also display\nAsset Store packages\nthat you downloaded from the Asset Store.\nMore info\nSee in\nGlossary\nthat enable you to achieve specific results in Unity. For example, the 2D\nfeature set\nprovides all the functionality you need to create 2D games for various art styles.\nAll the packages in a feature set are compatible with each other for that version of the feature set. You can install feature sets using the\nPackage Manager\n.\nThe following feature sets are available in this release of Unity:\n2D\n: Create 2D game worlds with animated characters and 2D physics.\n3D Characters and Animation\n: Animate characters and create cutscenes, sequences or movies.\n3D World Building\n: Use artist-friendly tools to create 3D, open-world environments that are believable and interactive.\nAR\nAugmented Reality\nMore info\nSee in\nGlossary\n: Create\naugmented reality\nAugmented Reality (AR) uses computer graphics or video composited on top of a live video feed to augment the view and create interaction with real and virtual objects.\nMore info\nSee in\nGlossary\nexperiences that interact with the real world.\nECS\n: Create experiences using a data-oriented design approach, to scale processing in a highly performant manner.\nEngineering\n: Enable support for integrated development environments, and use tools to test and analyze your project’s performance.\nGameplay and Storytelling\n: Create dynamic\ncamera\nA component which creates an image of a particular viewpoint in your scene. The output is either drawn to the screen or captured as a texture.\nMore info\nSee in\nGlossary\nshots, and arrange cinematic content to create a story for your project.\nMobile\n: Optimize your apps for mobile devices.\nVR\nVirtual Reality\nMore info\nSee in\nGlossary\n: Add interactivity to your applications to create\nvirtual reality\nVirtual Reality (VR) immerses users in an artificial 3D world of realistic images and sounds, using a headset and motion tracking.\nMore info\nSee in\nGlossary\nexperiences.\nAdditional resources\nDetails panel reference (feature sets)\nInstall a feature set\nDeprecated packages\n2D feature set\nCopyright ©2005-2026 Unity Technologies. All rights reserved. Built from 6000.3.5f1 (9e864d5a2e6f). Built on: 2026-01-09.\nTutorials\nCommunity Answers\nKnowledge Base\nForums\nAsset Store\nTerms of use\nLegal\nPrivacy Policy\nCookies\nDo Not Sell or Share My Personal Information\nYour Privacy Choices (Cookie Settings)\n",
  "properties": []
}