{
  "name": "manual_other_Conventional",
  "type": "manual",
  "description": "",
  "content": "// Unity Manual: Input_Conventional\n// URL: https://docs.unity3d.com/Manual/ConventionalGameInput.html\n\nInput\nLegacy Input\nInput Manager\nLegacy Input\nMobile device input\nInput Manager\nImportant\n:\nInput Manager\nis a legacy feature and not recommended for new projects.\nFor new projects you should use the\nInput System Package\n.\nThe\nInput Manager\nwindow allows you to define input axes and their associated actions for your Project. To access it, from Unity’s main menu, go to\nEdit > Project Settings\n, then select\nInput Manager\nfrom the navigation on the right.\nThe Input Manager uses the following types of controls:\nKey\nrefers to any key on a physical keyboard, such as W, Shift, or the space bar.\nButton\nrefers to any button on a physical controller (for example, gamepads), such as the X button on a remote control.\nA\nvirtual axis\n(plural:\naxes\n) is mapped to a control, such as a button or a key. When the user activates the control, the axis receives a value in the range of [–1..1]. You can use this value in your\nscripts\nA piece of code that allows you to create your own Components, trigger game events, modify Component properties over time and respond to user input in any way you like.\nMore info\nSee in\nGlossary\n.\nPhysical keys\nThe Physical keys option allows you to map key codes to the physical keyboard layout, rather than to the language-specific layout that may vary between users in different regions.\nFor example, on some keyboards the first row of letters reads “QWERTY”, and on others it reads “AZERTY”. This means if you scripted specific controls to use the well known “WASD” keys for movement, they would not be in the correct physical arrangement (like the arrow-key arrangement) on an AZERTY-layout keyboard.\nWith Physical Keys enabled, Unity uses a generic ANSI/ISO “Qwerty” layout to represent the\nphysical location\nof the keys regardless of the user’s actual layout. This means if you specify the “Q” key, it will always be the left-most letter on the first row of letter keys, even if the user’s keyboard has a different letter in that position.\nNote, you should not read key input for in-game text input, because this will not allow users to enter non-Latin characters. Instead, use\nInput.compositionString\n.\nVirtual axes\nEvery Project you create has a number of input axes created by default. These axes enable you to use keyboard, mouse, and joystick input in your Project straight away.\nTo see more about these axes, open the\nInput Manager\nwindow, and click the arrow next to any axis name to expand its properties.\nEach input axis has the following properties:\nProperty\nFunction\nName\nAxis name. You can use this to access the axis from scripts.\nDescriptive Name, Descriptive Negative Name\nThese values are deprecated and do not work. Previously, they displayed for the user on the Rebind Controls screen at startup, but this screen has also been deprecated.\nNegative Button, Positive Button\nThe controls to push the axis in the negative and positive direction respectively. These can be keys on a keyboard, or buttons on a joystick or mouse.\nAlt Negative Button, Alt Positive Button\nAlternative controls to push the axis in the negative and positive direction respectively.\nGravity\nSpeed in units per second that the axis falls toward neutral when no input is present.\nDead\nHow far the user needs to move an analog stick before your application registers the movement. At runtime, input from all analog devices that falls within this range will be considered null.\nSensitivity\nSpeed in units per second that the axis will move toward the target value. This is for digital devices only.\nSnap\nIf enabled, the axis value will reset to zero when pressing a button that corresponds to the opposite direction.\nType\nThe type of input that controls the axis. Select from these values:\n- Key or Mouse button\n- Mouse Movement\n- Joystick Axis\nAxis\nThe axis of a connected device that controls this axis.\nJoyNum\nThe connected Joystick that controls this axis. You can select a specific joystick, or query input from all joysticks.\nAxis values can be:\nBetween –1 and 1 for joystick and keyboard input. The neutral position for these axes is 0. Some types of controls, such as buttons on a keyboard, aren’t sensitive to input intensity, so they can’t produce values other than –1, 0, or 1.\nMouse delta (how much the mouse has moved during the last frame) for mouse input. The values for mouse input axes can be larger than 1 or smaller than –1 when the user moves the mouse quickly.\nAdding, removing, and copying virtual axes\nTo add a virtual axis, increase the number in the\nSize\nfield. This creates a new axis at the bottom of the list. The new axis copies the properties of the previous axis in the list.\nTo remove a virtual axis, you can either:\nDecrease the number in the\nSize\nfield. This removes the last axis in the list.\nRight-click any axis, and select\nDelete Array Element\n.\nNote:\nYou can’t undo this action.\nTo copy a virtual axis, right-click it and select\nDuplicate Array Element\n.\nMapping virtual axes to controls\nTo map a key or button to an axis, enter its name in the\nPositive Button\nor\nNegative Button\nproperty in the Input Manager.\nKey names follow these naming conventions:\nKey family\nNaming convention\nLetter keys\na\n,\nb\n,\nc\n…\nNumber keys\n1\n,\n2\n,\n3\n…\nArrow keys\nup\n,\ndown\n,\nleft\n,\nright\nNumpad keys\n[1]\n,\n[2]\n,\n[3]\n,\n[+]\n,\n[equals]\n…\nModifier keys\nright shift\n,\nleft shift\n,\nright ctrl\n,\nleft ctrl\n,\nright alt\n,\nleft alt\n,\nright cmd\n,\nleft cmd\nSpecial keys\nbackspace\n,\ntab\n,\nreturn\n,\nescape\n,\nspace\n,\ndelete\n,\nenter\n,\ninsert\n,\nhome\n,\nend\n,\npage up\n,\npage down\nFunction keys\nf1\n,\nf2\n,\nf3\n…\nMouse buttons are named\nmouse 0, mouse 1, mouse 2,\nand so on.\nJoystick buttons follow these naming conventions:\nButton origin\nNaming convention\nA specific button on any joystick\njoystick button 0\n,\njoystick button 1\n,\njoystick button 2\n…\nA specific button on a specific joystick\njoystick 1 button 0\n,\njoystick 1 button 1\n,\njoystick 2 button 0\n…\nYou can also query input for a specific key or button with\nInput.GetKey\nand the naming conventions specified above. For example:\nInput.GetKey(\"a\");\nAnother way to access keys is to use the\nKeyCode\nenumeration.\nUsing virtual axes in scripts\nTo access virtual axes from scripts, you can use the axis name.\nFor example, to query the current value of the Horizontal axis and store it in a variable, you can use\nInput.GetAxis\nlike this:\nfloat horizontalInput = Input.GetAxis (\"Horizontal\");\nFor axes that describe an event rather than a movement (for example, firing a weapon in a game), use\nInput.GetButtonDown\ninstead.\nIf two or more axes have the same name, the query returns the axis with the largest absolute value. This makes it possible to assign more than one input device to an axis name.\nFor example, you can create two axes named Horizontal and assign one to keyboard input and the other to joystick input. If the user is using the joystick, input comes from the joystick and keyboard input is null. Otherwise, input comes from the keyboard and joystick input is null. This enables you to write a single script that covers input from multiple controllers.\nExample\nYou can use input from the\nHorizontal\nand\nVertical\naxes and the\ntransform.Translate\nmethod to move a\nGameObject\nThe fundamental object in Unity scenes, which can represent characters, props, scenery, cameras, waypoints, and more. A GameObject’s functionality is defined by the Components attached to it.\nMore info\nSee in\nGlossary\nin XZ space (forward, back, left, or right). Add the following code to the\nupdate()\nmethod on a script attached to the GameObject you want to move:\nfloat moveSpeed = 10;\n\n//Define the speed at which the object moves.\n\n\n\nfloat horizontalInput = Input.GetAxis(\"Horizontal\");\n\n//Get the value of the Horizontal input axis.\n\n\n\nfloat verticalInput = Input.GetAxis(\"Vertical\");\n\n//Get the value of the Vertical input axis.\n\n\n\ntransform.Translate(new Vector3(horizontalInput, verticalInput, 0) * moveSpeed * Time.deltaTime);\n\n//Move the object to XYZ coordinates defined as horizontalInput, 0, and verticalInput respectively.\nTime.deltaTime\nrepresents the time that passed since the last frame. Multiplying the\nmoveSpeed\nvariable by\nTime.deltaTime\nensures that the GameObject moves at a constant speed every frame.\nInputManager\nLegacy Input\nMobile device input\n",
  "properties": []
}