{
  "name": "manual_other_SDK",
  "type": "manual",
  "description": "",
  "content": "// Unity Manual: XR_SDK\n// URL: https://docs.unity3d.com/Manual/XR.html\n\nXR\nAI menu reference\nOverview\nXR\nImportant\n: A critical security vulnerability has been identified affecting games and applications built with Unity 2017.1 and later for Android, Windows, macOS, and Linux. To learn more about this vulnerability and the action you must take, refer to\nUnity Platform Protection: Developer Remediation Guide\n.\nXR is an umbrella term that includes the following types of applications:\nVirtual Reality\nVirtual Reality (VR) immerses users in an artificial 3D world of realistic images and sounds, using a headset and motion tracking.\nMore info\nSee in\nGlossary\n(VR): The application simulates a self-contained environment around the user.\nMixed Reality\nMixed Reality (MR) combines its own virtual environment with the user’s real-world environment and allows them to interact with each other.\nSee in\nGlossary\n(MR): The application combines its own environment with the user’s real-world environment and allows them to interact with each other.\nAugmented Reality\nAugmented Reality (AR) uses computer graphics or video composited on top of a live video feed to augment the view and create interaction with real and virtual objects.\nMore info\nSee in\nGlossary\n(AR): The application layers content over a view of the real world.\nThe span between virtual to augmented reality is a continuum, with mixed reality falling somewhere in the middle, depending on the capabilities of a particular device and the intent of your application.\nSample XR scene view\nThis documentation discusses how to develop\nXR\napplications in Unity:\nTopic\nDescription\nOverview\nAn overview of how Unity supports XR development.\nSet up an XR Project\nHow to set up a project for an XR game or application.\nSet up an XR scene\nHow to add the\nGameObjects\nThe fundamental object in Unity scenes, which can represent characters, props, scenery, cameras, waypoints, and more. A GameObject’s functionality is defined by the Components attached to it.\nMore info\nSee in\nGlossary\nand components needed by an XR\nscene\nA Scene contains the environments and menus of your game. Think of each unique Scene file as a unique level. In each Scene, you place your environments, obstacles, and decorations, essentially designing and building your game in pieces.\nMore info\nSee in\nGlossary\n.\nRun an XR application\nHow to build and run Unity XR projects during development.\nXR graphics\nXR-specific graphics topics.\nXR audio\nUnderstand audio for XR projects.\nAdditional resources and examples\n⚙️\nSample project\n:\nXR Interaction Toolkit samples\n⚙️\nSample project\n:\nAR Foundation Samples\n💡\nResources\n:\nBuild for XR and spatial computing\n💡\nResources\n:\nUnity Learn XR resources\n👥\nCommunity\n:\nJoin the conversation on Unity Discussions for XR\n💡\nResources\n:\nUnity Blog XR posts\n💡\nResources\n:\nXR Glossary\n📖\nE-Book\n:\nCreate virtual and mixed reality experiences in Unity\n📺\nVideo\n:\nWorldbuilding in VR with Unity’s XR Interaction Toolkit\n📺\nVideo\n:\nOptimization for web, XR & mobile games in Unity 6\n📖\nE-Book\n:\nOptimize your game performance for mobile, XR, and Web in Unity\n📖\nE-Book\n:\nOptimize your game performance for consoles and PCs in Unity\nAI menu reference\nOverview\n",
  "properties": []
}