{
  "name": "manual_graphics_lighting",
  "type": "manual",
  "description": "",
  "content": "// Unity Manual Page: lighting\n// URL: https://docs.unity3d.com/Manual/LightingOverview.html\n// Content Length: 3393 characters\n\n// Manual Content:\nLighting Video Profiler module reference Introduction to lighting Lighting A scene with photo-realistic lighting. With Unity, you can achieve realistic lighting that is suitable for a range of art styles. Page Description Introduction to lighting Resources for learning about lighting and choosing a lighting setup. Lighting configuration workflow Resources for selecting a render pipeline A series of operations that take the contents of a Scene, and displays them on a screen. Unity lets you choose from pre-built render pipelines, or write your own. More info See in Glossary , configuring global lighting settings, and adding lighting elements. Light sources Resources for adding light to a scene A Scene contains the environments and menus of your game. Think of each unique Scene file as a unique level. In each Scene, you place your environments, obstacles, and decorations, essentially designing and building your game in pieces. More info See in Glossary , with Light components, ambient light Light that doesn’t come from any specific direction, and contributes equal light in all directions to the Scene. More info See in Glossary , emissive materials, and cookies. Direct and indirect lighting Resources on choosing whether Unity calculates global illumination A group of techniques that model both direct and indirect lighting to provide realistic lighting results. See in Glossary in real time, or stores baked lighting in a build. Shadows A UI component that adds a simple outline effect to graphic components such as Text or Image. It must be on the same GameObject as the graphic component. More info See in Glossary Techniques and resources for Lights casting shadows from a GameObject The fundamental object in Unity scenes, which can represent characters, props, scenery, cameras, waypoints, and more. A GameObject’s functionality is defined by the Components attached to it. More info See in Glossary onto other parts of itself, or onto nearby GameObjects. Reflections Techniques and resources for using Reflection Probes A rendering component that captures a spherical view of its surroundings in all directions, rather like a camera. The captured image is then stored as a Cubemap that can be used by objects with reflective materials. More info See in Glossary to capture and display reflections on GameObjects. Lighting in URP Resources and approaches for lighting in the Universal Render Pipeline (URP). Lighting in the Built-In Render Pipeline Resources and approaches for lighting in the Built-In Render Pipeline. Lighting reference Explore lighting properties and settings, for example in the Lighting window, the Lighting Settings Asset, and Debug Draw Modes. Additional resources and examples 👥 Community : Join the conversation on Unity Discussions for Graphics 📖 E-Book : Introduction to the Universal Render Pipeline for advanced creators (Unity 6 edition) 📺 Video : The URP 3D Sample - a short introduction 📺 Video : Understanding URP settings and essentials 📚 Documentation : Visual effects Video Profiler module reference Introduction to lighting Copyright ©2005-2026 Unity Technologies. All rights reserved. Built from 6000.3.5f1 (9e864d5a2e6f). Built on: 2026-01-09. Tutorials Community Answers Knowledge Base Forums Asset Store Terms of use Legal Privacy Policy Cookies Do Not Sell or Share My Personal Information Your Privacy Choices (Cookie Settings)\n",
  "properties": []
}