{
  "name": "manual_audio_Audio_reference",
  "type": "manual",
  "description": "",
  "content": "// Unity Manual: Audio reference\n// Section: Audio\n// URL: https://docs.unity3d.com/Manual/class-AudioManager.html\n\n// Content:\nThe Editor interface\nProject Settings\nAudio\nUse the Project Settings window\nEditor\nAudio\nThe\nAudio\nsettings (main menu:\nEdit\n>\nProject Settings\n, then select the\nAudio\ncategory) allows you to tweak the maximum volume of all sounds playing in the scene.\nAudio settings\nProperty\nFunction\nGlobal Volume\nSet the volume for all sounds during playback.\nVolume Rolloff Scale\nSet the global attenuation rolloff factor for\nLogarithmic rolloff-based sources\n. The higher the value, the faster the volume attenuates. Conversely, the lower the value, the slower it attenuates.\nTip:\nA value of 1 simulates the “real world”.\nDoppler Factor\nSet how audible the Doppler effect is. Use 0 to disable it. Use 1 make it audible for fast moving objects.\nTip:\nAfter setting the\nDoppler Factor\nto 1, you can tweak both\nSpeed of Sound\nand\nDoppler Factor\nuntil you are satisfied.\nDefault Speaker Mode\nSet which speaker mode should be the default for your project. The default is 2, which corresponds to stereo speakers. For the full list of modes, see the\nAudioSpeakerMode\nAPI reference.\nNote:\nYou can also change the speaker mode at runtime through scripting. See\nAudio Settings\nfor details.\nSystem Sample Rate\nSet the output sample rate. If set to 0, Unity uses the sample rate of the system.\nNote:\nThis only serves as a reference only, since certain platforms allow you to change the sample rate, such as iOS or Android.\nDSP Buffer Size\nSet the size of the DSP buffer to optimize for latency or performance. Latency is a measure of how long it takes for the audio output to react to input / API commands. The following options are available:\nDefault\n- Default buffer size.\nBest Latency\n- Trade off performance in favour of latency. Audio responds faster but uses more system resources.\nGood Latency\n- Balance between latency and performance.\nBest Performance\n- Trade off latency in favour of performance. Audio has a slight delay but the system runs more efficiently.\nMax Virtual Voices\nSet the number of virtual voices that the audio system manages. This value should always be larger than the number of voices played by the game. If not, Unity displays warnings in the console.\nMax Real Voices\nSet the number of real voices that can play at the same time. At every frame, the loudest voice is picked.\nSpatializer Plugin\nChoose which native audio plugin to use in order to perform spatialized filtering of 3D sources.\nAmbisonic Decoder Plugin\nChoose which native audio plugin to perform ambisonic-to-binaural filtering of sources.\nDisable Unity Audio\nEnable to deactivate the audio system in standalone builds.\nIn the Editor the audio system is still on and supports previewing audio clips, but Unity does not handle calls to\nAudioSource.Play\nand\nAudioSource.playOnAwake\nin order to simulate behavior of the standalone build.\nEnable Output Suspension\nAutomatically suspends audio output after it detects the output has been silent for a long duration (editor only). Suspending the audio system disables the mechanism in the operating system that prevents the computer going into sleep mode.\nVirtualize Effect\nEnable to dynamically turn off effects and spatializers on AudioSources that are culled in order to save CPU.\nAudioManager\nUse the Project Settings window\nEditor\nCopyright ©2005-2026 Unity Technologies. All rights reserved. Built from 6000.3.5f1 (9e864d5a2e6f). Built on: 2026-01-09.\nTutorials\nCommunity Answers\nKnowledge Base\nForums\nAsset Store\nTerms of use\nLegal\nPrivacy Policy\nCookies\nDo Not Sell or Share My Personal Information\nYour Privacy Choices (Cookie Settings)\n",
  "properties": []
}