{
  "name": "manual_animation_Rig_tab_of_the_Import_Settings_window",
  "type": "manual",
  "description": "",
  "content": "// Unity Manual: Rig tab of the Import Settings window\n// Section: Animation\n// URL: https://docs.unity3d.com/Manual/FBXImporter-Rig.html\n\n// Content:\nGameObjects\nModels\nImporting models into Unity\nModel Import Settings reference\nRig tab\nModel tab Import Settings reference\nAvatar Mapping tab\nRig tab\nThe settings on the\nRig\ntab define how Unity maps the deformers to the\nmesh\nThe main graphics primitive of Unity. Meshes make up a large part of your 3D worlds. Unity supports triangulated or Quadrangulated polygon meshes. Nurbs, Nurms, Subdiv surfaces must be converted to polygons.\nMore info\nSee in\nGlossary\nin the imported model so that you can animate it. For humanoid characters, this means\nassigning or creating an avatar\n. For non-humanoid (generic) characters, this means\nidentifying a root bone in the skeleton\n.\nTo open the Rig tab, select a mesh, and in the\nInspector\nA Unity window that displays information about the currently selected GameObject, asset or project settings, allowing you to inspect and edit the values.\nMore info\nSee in\nGlossary\nselect the\nRig\ntab.\nAnimation Type\nThe value you select for the\nAnimation Type\ndetermines the layout for the\nRig\ntab.\nBy default, when you select a model in the\nProject\nIn Unity, you use a project to design and develop a game. A project stores all of the files that are related to a game, such as the asset and Scene files.\nMore info\nSee in\nGlossary\nview, Unity determines which\nAnimation Type\nbest matches the selected model and displays it in the\nRig\ntab. If Unity has never imported the file, the Animation Type is set to\nNone\n.\nProperty\nDescription\nNone\nNo animation present.\nLegacy\nUse the\nLegacy Animation System\n. Import and use animations as with Unity version 3.x and earlier.\nGeneric\nUse the\nGeneric Animation System\nif your rig is non-humanoid (quadruped or any entity to be animated). Unity picks a root node automatically but you can identify another bone to use as the\nRoot node\nA transform in an animation hierarchy that allows Unity to establish consistency between Animation clips for a generic model. It also enables Unity to properly blend between Animations that have not been authored “in place” (that is, where the whole Model moves its world position while animating).\nMore info\nSee in\nGlossary\ninstead.\nHumanoid\nUse the\nHumanoid Animation System\nif your rig is humanoid (it has two legs, two arms and a head). Unity usually detects the skeleton and maps it to the Avatar correctly. In some cases, you may need to set the\nAvatar Definition\nand configure the mapping manually.\nGeneric animation types\nGeneric Animations\ndo not use Avatars like\nHumanoid animations\nAn animation using humanoid skeletons. Humanoid models generally have the same basic structure, representing the major articulate parts of the body, head and limbs. This makes it easy to map animations from one humanoid skeleton to another, allowing retargeting and inverse kinematics.\nMore info\nSee in\nGlossary\ndo. Since the skeleton can be arbitrary, you must specify which bone is the\nRoot node\n. The Root node allows Unity to establish consistency between\nAnimation clips\nAnimation data that can be used for animated characters or simple animations. It is a simple “unit” piece of motion, such as (one specific instance of) “Idle”, “Walk” or “Run”.\nMore info\nSee in\nGlossary\nfor a generic model, and blend properly between Animations that have not been authored “in place” (that is, where the whole model moves its world position while animating).\nSpecifying the root node helps Unity determine between movement of the bones relative to each other, and motion of the Root node in the world (controlled from\nOnAnimatorMove\n).\nProperty\nDescription\nAvatar Definition\nChoose where to get the Avatar definition. The following options are available:\nCreate from this model\n- Create an Avatar based on this model\nCopy from Other Avatar\n- Point to an Avatar set up on another model.\nRoot node\nSelect the bone to use as a root node for this Avatar.\nThis setting is only available if you set the\nAvatar Definition\nto\nCreate From This Model\n.\nSource\nCopy another Avatar with an identical rig to import its animation clips.\nThis setting is only available if you set the\nAvatar Definition\nto\nCopy from Other Avatar\n.\nSkin Weights\nSet the maximum number of bones that can influence a single vertex. The following options are available:\nStandard (4 Bones)\n- Use a maximum influence of four bones. This is the default, and is recommended for performance.\nCustom\n- Set your own maximum number of bones. When you select this option, the\nMax Bones/Vertex\nand\nMax Bone Weight\nproperties appear.\nMax Bones/Vertex\nSet the maximum number of bones per vertex to influence a given vertex. You can set between 1 and 32 bones per vertex, but the higher the number of bones you use to influence a vertex, the greater the performance cost.\nThis setting is only available you set the\nSkin Weights\nproperty to\nCustom\n.\nMax Bone Weight\nSet the bottom threshold for considering bone weights. The weighting calculation ignores anything smaller than this value, and Unity scales up the bone weights higher than this value to a total of 1.0.\nThis setting is only available if the\nSkin Weights\nproperty is set to\nCustom\n.\nStrip Bones\nEnable to only add bones to Skinned\nMesh Renderers\nA mesh component that takes the geometry from the Mesh Filter and renders it at the position defined by the object’s Transform component.\nMore info\nSee in\nGlossary\nthat have skin weights assigned to them.\nOptimize Game Object\nRemove and store the GameObject Transform hierarchy of the imported character in the Avatar and Animator component. If enabled, the SkinnedMeshRenderers of the character use the Unity animation system’s internal skeleton, which improves the performance of the animated characters.\nOnly available if the\nAvatar Definition\nis set to\nCreate From This Model\n.\nExtra Transforms to Expose\nSpecify which Transform paths you want Unity to ignore when\nOptimize Game Object\nis enabled. For more information, see\nIncluding extra Transforms\n.\nThis section only appears when\nOptimize Game Object\nis enabled.\nHumanoid animation types\nYour rig is\nhumanoid\n(it has two legs, two arms and a head)\nWith rare exceptions, humanoid models have the same basic structure. This structure represents the major articulated parts of the body: the head and limbs. The first step to using Unity’s\nHumanoid animation features\nis to\nset up and configure\nan\nAvatar\nAn interface for retargeting animation from one rig to another.\nMore info\nSee in\nGlossary\n. Unity uses the Avatar to map the simplified humanoid bone structure to the actual bones present in the Model’s skeleton.\nProperty\nDescription\nAvatar Definition\nChoose where to get the Avatar definition. The following options are available:\nCreate from this model\n- Create an Avatar based on this model\nCopy from Other Avatar\n- Point to an Avatar set up on another model.\nSource\nCopy another Avatar with an identical rig to import its animation clips.\nOnly available if the\nAvatar Definition\nis set to\nCopy from Other Avatar\n.\nConfigure\nOpen the\nAvatar configuration\n.\nOnly available if the\nAvatar Definition\nis set to\nCreate From This Model\n.\nSkin Weights\nThis property is identical for both Humanoid and Generic Models. Refer to the\nSkin Weights\nproperty for\nGeneric\nmodels above for more information.\nStrip Bones\nEnable to only add bones to Skinned Mesh Renderers that have skin weights assigned to them.\nOptimize Game Object\nRemove and store the GameObject Transform hierarchy of the imported character in the Avatar and Animator component. If enabled, the SkinnedMeshRenderers of the character use the Unity animation system’s internal skeleton, which improves the performance of the animated characters.\nOnly available if the\nAvatar Definition\nis set to\nCreate From This Model\n.\nExtra Transforms to Expose\nSpecify which Transform paths you want Unity to ignore when\nOptimize Game Object\nis enabled. For more information, see\nIncluding extra Transforms\n.\nThis section only appears when\nOptimize Game Object\nis enabled.\nIncluding extra Transforms\nWhen you enable the\nOptimize Game Object\nproperty, Unity ignores any Transform which is part of the hierarchy but is not mapped in the Avatar, in order to improve CPU performance. However, you can mark specific nodes in the\nGameObject\nThe fundamental object in Unity scenes, which can represent characters, props, scenery, cameras, waypoints, and more. A GameObject’s functionality is defined by the Components attached to it.\nMore info\nSee in\nGlossary\nhierarchy to include in calculations using the\nExtra Transforms to Expose\nsection:\nThe Extra Transforms to Expose property appears when Optimize Game Objects is enabled\n(A)\nEnter the full or partial name in the search box to filter the list of Transforms. This makes it easier to navigate through characters with a large number of bones.\n(B)\nEnable each Transform (bones of a skeleton) you want Unity to include in calculations.\n(C)\nUse the buttons to help select specific Transforms. For example, the\nToggle All\nbutton selects or deselects everything at once (regardless of the current selection, including filtered items).\n(D)\nUse the\nRevert\nbutton to undo your selections or the\nApply\nbutton to apply the exceptions to the Model.\nNote\n: In optimized mode, skinned Mesh matrix extraction is multi-threaded.\nLegacy animation types\nProperty\nDescription\nGeneration\nSelect the animation import method. The following options are available:\nDon’t Import\n- Do not import animation\nStore in Original Roots (Deprecated)\n- Deprecated. Do not use.\nStore in Nodes (Deprecated)\n- Deprecated. Do not use.\nStore in Root (Deprecated)\n- Deprecated. Do not use.\nStore in Root (New)\n- Import the animation and store it in the Model’s root node. This is the default setting.\nSkin Weights\nThis property is the same for Legacy as for Humanoid and Generic Models. Refer to the\nSkin Weights\nproperty for\nGeneric\nmodels above for more information.\nStrip Bones\nEnable to only add bones to Skinned Mesh Renderers that have skin weights assigned to them.\nFor more information about legacy animation, refer to the documentation for\nLegacy Animation System\n.\nModel tab Import Settings reference\nAvatar Mapping tab\nCopyright ©2005-2026 Unity Technologies. All rights reserved. Built from 6000.3.5f1 (9e864d5a2e6f). Built on: 2026-01-09.\nTutorials\nCommunity Answers\nKnowledge Base\nForums\nAsset Store\nTerms of use\nLegal\nPrivacy Policy\nCookies\nDo Not Sell or Share My Personal Information\nYour Privacy Choices (Cookie Settings)\n",
  "properties": []
}