{
  "name": "manual_other_Introduction",
  "type": "manual",
  "description": "",
  "content": "// Unity Manual: Terrain_Introduction\n// URL: https://docs.unity3d.com/Manual/script-Terrain.html\n\nWorld building\nTerrain\nProcedural Skybox Shader Material Inspector Window reference\nCreate and edit Terrains\nTerrain\nThe Unity Editor includes a built-in set of\nTerrain\nThe landscape in your scene. A Terrain GameObject adds a large flat plane to your scene and you can use the Terrain’s Inspector window to create a detailed landscape.\nMore info\nSee in\nGlossary\nfeatures that you can use to add landscapes to your game. In the Unity Editor, you can create multiple Terrain tiles, adjust the height or appearance of your landscape, and add trees or grass to it. At runtime, Unity optimizes built-in Terrain rendering for efficiency. The pages in this section explain the built-in options available for Terrain and how to use them.\nTopic\nDescription\nCreate and edit Terrains\nAdd and edit Terrain\nGameObjects\nThe fundamental object in Unity scenes, which can represent characters, props, scenery, cameras, waypoints, and more. A GameObject’s functionality is defined by the Components attached to it.\nMore info\nSee in\nGlossary\nCreate Neighbor Terrains\nCreate adjacent Terrain tiles\nHeight\nSculpt the terrain’s height with the built-in Terrain system and the Terrain Tools package\nTextures and layers\nPaint textures on the terrain and combine them in layers\nBrushes\nUnderstand Brushes and Brush settings\nAdd trees to the terrain\nCreate and customize Trees\nAnimate trees with Wind Zones\nSimulate wind to animate trees on your Terrain.\nWind Zones\nAdjust\nWind Zone\nA GameObject that adds the effect of wind to your terrain. For instance, Trees within a wind zone will bend in a realistic animated fashion and the wind itself will move in pulses to create natural patterns of movement among the tree.\nMore info\nSee in\nGlossary\nsettings\nGrass and other details\nAdd and remove paint details\nWorking with Heightmaps\nImport and export\nheightmaps\nA greyscale Texture that stores height data for an object. Each pixel stores the height difference perpendicular to the face that pixel represents.\nSee in\nGlossary\nTerrain Settings reference\nAdjust the Terrain settings\nRender Terrain with Shader Graph\nUse\nShader\nA program that runs on the GPU.\nMore info\nSee in\nGlossary\nGraph to create a new material for HDRP or URP terrains\nUsing Terrain at runtime\nCreate Terrain dynamically at runtime\nAdditional resources\nTerrain and the Terrain Tools package\nCreate trees with Tree Editor\nTerrain Texture Node\nin Shader Graph\nProcedural Skybox Shader Material Inspector Window reference\nCreate and edit Terrains\n",
  "properties": []
}