{
  "name": "manual_audio_Native_audio_plug-in_SDK",
  "type": "manual",
  "description": "",
  "content": "// Unity Manual: Native audio plug-in SDK\n// Section: Audio\n// URL: https://docs.unity3d.com/Manual/AudioMixerNativeAudioPlugin.html\n\n// Content:\nAudio\nNative audio plug-in SDK\nOverview of Usage and API\nDevelop a native DSP audio plug-in\nNative audio plug-in SDK\nThe Unity native audio\nplug-in\nA set of code created outside of Unity that creates functionality in Unity. There are two kinds of plug-ins you can use in Unity: Managed plug-ins (managed .NET assemblies created with tools like Visual Studio) and Native plug-ins (platform-specific native code libraries).\nMore info\nSee in\nGlossary\nSDK lets you develop custom audio plug-ins for Unity. You can use this SDK to extend the audio capabilities of Unity and create advanced audio processing solutions tailored to your project’s needs. Examples of custom audio plug-ins you can create include\naudio effects\nAny effect that can modify the output of Audio Mixer components, such as filtering frequency ranges of a sound or applying reverb.\nMore info\nSee in\nGlossary\nand\naudio spatializers\nA plug-in that changes the way audio is transmitted from an audio source into the surrounding space. It takes the source and regulates the gains of the left and right ear contributions based on the distance and angle between the AudioListener and the AudioSource.\nMore info\nSee in\nGlossary\n.\nThe native audio plug-in system consists of two parts:\nThe native audio Digital Signal Processing (DSP) plug-in\nThe managed graphical user interface (GUI)\nRefer to the following pages to learn more about how to create an audio plug-in, customize the plug-in’s GUI, and access useful examples.\nTopic\nDescription\nDevelop a native audio DSP plug-in for Unity\nLearn how to create your own native DSP plug-in.\nCustomize the Unity GUI for your audio plug-in\nLearn how to customize the GUI of your audio plug-in.\nImport your audio plug-in and GUI to Unity\nLearn how to prepare your plug-in and GUI for Unity and import them.\nExample plug-ins\nExample DSP plug-ins with and without GUI customization.\nImportant files your DSP and GUI code uses\nThe\nAudioPluginInterface.h\nfile has the necessary structures, types, and function declarations required to create a custom audio plug-in.\nBoth native DSP and GUI DLLs can contain multiple plug-ins. To add multiple plug-in effects within the same DLL, Unity provides additional code to handle the effect definition and parameter registration in a unified manner:\nAudioPluginUtil.h\nAudioPluginUtil.cpp\nIf you want your DLLs to contain multiple effects, include\nAudioPluginUtil.h\nin your code.\nAdditional resources\nAudio Mixer\nAudio Spatializer SDK\nAmbisonic Audio\nOverview of Usage and API\nDevelop a native DSP audio plug-in\nCopyright ©2005-2026 Unity Technologies. All rights reserved. Built from 6000.3.5f1 (9e864d5a2e6f). Built on: 2026-01-09.\nTutorials\nCommunity Answers\nKnowledge Base\nForums\nAsset Store\nTerms of use\nLegal\nPrivacy Policy\nCookies\nDo Not Sell or Share My Personal Information\nYour Privacy Choices (Cookie Settings)\n",
  "properties": []
}