{
  "name": "manual_other_Import",
  "type": "manual",
  "description": "",
  "content": "// Unity Manual: Assets_Import\n// URL: https://docs.unity3d.com/Manual/ImportingAssets.html\n\nAssets and media\nImporting assets\nIntroduction to importing assets\nImporting assets\nAsset metadata\nIntroduction to importing assets\nWhen you create a Unity project, Unity creates a folder for your project which contains an\nAssets\nsubfolder. You can use this folder to store assets created outside of Unity to then use in your project.\nUsing the Assets folder\nYou can either export the asset file directly into the\nAssets\nfolder, or copy it into the folder. For many common formats, you can save the source file directly into your project’s\nAssets\nfolder and Unity can read it. Unity also detects when you save new changes to the file and re-imports files as necessary.\nFor a list of supported asset types, refer to\nSupported asset type reference\n.\nManaging assets in the Project window\nUse the\nProject window\nA window that shows the contents of your\nAssets\nfolder (Project tab)\nMore info\nSee in\nGlossary\nto view the contents of your\nAssets\nfolder. Whenever you save or copy a file to your\nAssets\nfolder, Unity imports it and it then appears in your Project window. If you drag a file from your computer’s file browser into Unity’s Project window, Unity makes a copy and places it into your\nAssets\nfolder. You can then access this copy from the Project window.\nWarning:\nUsually, the items that appear in your Project window represent actual files on your computer. If you delete them in the Project window, you also delete them from your computer.\nThe Project window with the Assets folder opened, containing food related models.\nModifying asset files\nWhen you modify a file in Unity, Unity doesn’t modify your original source file. Instead, the import process reads your source file, and creates a representation of your asset internally, which matches your chosen\nimport settings\n. If you modify the import settings for an asset, or make a change to the source file in the\nAssets\nfolder, Unity re-imports the asset again to reflect your changes.\nIf you want to move or rename assets in your project, it’s best practice to do it in the Project window. Unity then automatically moves or renames the asset’s corresponding\n.meta\nfile. For more information on .meta files, refer to\nAsset metadata\n.\nIf you drag a file from your computer’s file browser into Unity’s Project window, Unity makes a copy and places it into your\nAssets\nfolder. You can then access this copy from the Project window.\nComplex assets\nIf you import a single asset file that contains complex information, Unity might create multiple assets from it. For example:\nIf a 3D file (such as an FBX file) defines materials or contains embedded textures, Unity extracts the\nmaterials and embedded textures\nas separate assets.\nIf you want to import an image file as multiple 2D\nsprites\nA 2D graphic objects. If you are used to working in 3D, Sprites are essentially just standard textures but there are special techniques for combining and managing sprite textures for efficiency and convenience during development.\nMore info\nSee in\nGlossary\n. Use the 2D\nSprite Editor\nto define multiple sprites from a single graphic image and Unity displays each sprite as a separate sprite asset in the Project window.\nIf a 3D file contains multiple animation timelines or multiple clips, Unity automatically defines separate animation timelines or clips based on its\nanimation import settings\n. The resulting multiple animation clips appear as separate\nAnimation Clip\nAnimation data that can be used for animated characters or simple animations. It is a simple “unit” piece of motion, such as (one specific instance of) “Idle”, “Walk” or “Run”.\nMore info\nSee in\nGlossary\nassets in the Project window.\nAsset processing\nUnity reads and processes any files that you add to the\nAssets\nfolder and converts the contents of the file to internal data that’s correctly formatted for your application’s target platform. The source asset files remain unchanged, and Unity stores the internal data in the project’s\nLibrary\nfolder. This data is part of Unity’s\nAsset Database\n.\nUnity uses internal formats for assets so it can use versions of your assets at runtime in the Unity Editor, and can keep your unmodified source files in the\nAssets\nfolder. This system means that you can edit an asset file and the Editor picks up the changes automatically. For example, hardware such as mobile devices can’t convert\n.psd\nfiles directly to render them as textures. When you place a\n.psd\nfile in the\nAssets\nfolder, Unity converts the file to an internal version that mobile devices can process.\nUnity stores the internal representation of your assets in the\nLibrary\nfolder, which behaves like a cache folder. You don’t need to ever alter the\nLibrary\nfolder manually, and if you do, you might negatively affect your project. This also means that you don’t need to include the\nLibrary\nfolder under\nversion control\nA system for managing file changes. You can use Unity in conjunction with most common version control tools, including Perforce, Git, Mercurial and PlasticSCM.\nMore info\nSee in\nGlossary\n.\nTip:\nIf your project isn’t open, you can safely delete the\nLibrary\nfolder, because Unity can regenerate all its data from the\nAssets\nand\nProjectSettings\nfolders the next time you launch your project.\nAsset import settings\nEach type of asset that Unity supports has a set of import settings, which affect how the asset appears or behaves. To view an asset’s import settings, select the asset in the Project window. The import settings for the selected asset appear in the\nInspector\nA Unity window that displays information about the currently selected GameObject, asset or project settings, allowing you to inspect and edit the values.\nMore info\nSee in\nGlossary\n. The options that appear vary depending on the type of asset selected.\nA selected model’s Inspector window with its Import Settings displayed.\nFor more information, refer to the documentation on the following Import Settings:\nModel Import Settings\nSketchUp Import Settings\nSpeedTree Import Settings\nTexture Import Settings\nCubemap texture Import Settings\nAnimation Import Settings\nAssembly Definition Import Settings\nAudio Import Settings\nIf you’re developing a cross-platform project, you can override the default settings and assign different import settings on a per-platform basis.\nReusing assets between projects\nAs you build your application,\nUnity stores metadata\nabout your assets, such as import settings and links to other assets, among other information. If you want to transfer your assets into a different project and preserve all this information, you can export your assets into one of the following containers:\nAn\nasset package\nA collection of files and data from Unity projects, or elements of projects, which are compressed and stored in one file, similar to Zip files, with the\n.unitypackage\nextension. Asset packages are a handy way of sharing and re-using Unity projects and collections of assets.\nMore info\nSee in\nGlossary\n, which you can create directly in the Editor.\nA\ncustom package\n, which you can access and manage inside the\nPackage Manager\n.\nAdditional resources\nAsset packages\nMaterials and shaders\nTextures and videos\nSprite Editor\nAudio files\nImporting assets\nAsset metadata\n",
  "properties": []
}